Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xfc6 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xce441): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xd5de9): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x20d03): C:/Users/NDC/Desktop/conc_test/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x776bc): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x4500c): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0xe7d8b): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0xb2a85): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xc3fcd): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xe6419): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x143d1): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x98220): __uint32_t
    <69>   DW_AT_decl_file   : 3
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x5ae3b): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x6c6a0): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x3159c): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x13688): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x4500e): uint8_t
    <98>   DW_AT_decl_file   : 4
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0xaf6bf): uint16_t
    <a9>   DW_AT_decl_file   : 4
    <aa>   DW_AT_decl_line   : 36
    <ab>   DW_AT_decl_column : 20
    <ac>   DW_AT_type        : <0x4a>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0xe6047): uint32_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 48
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x64>
 <1><bc>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 6 (DW_TAG_array_type)
    <c2>   DW_AT_type        : <0xb0>
    <c6>   DW_AT_sibling     : <0xd1>
 <2><ca>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cb>   DW_AT_type        : <0x8c>
    <cf>   DW_AT_upper_bound : 1
 <2><d0>: Abbrev Number: 0
 <1><d1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d2>   DW_AT_byte_size   : 24
    <d3>   DW_AT_decl_file   : 5
    <d4>   DW_AT_decl_line   : 302
    <d6>   DW_AT_decl_column : 9
    <d7>   DW_AT_sibling     : <0x14a>
 <2><db>: Abbrev Number: 9 (DW_TAG_member)
    <dc>   DW_AT_name        : DR
    <df>   DW_AT_decl_file   : 5
    <e0>   DW_AT_decl_line   : 304
    <e2>   DW_AT_decl_column : 18
    <e3>   DW_AT_type        : <0xbc>
    <e7>   DW_AT_data_member_location: 0
 <2><e8>: Abbrev Number: 9 (DW_TAG_member)
    <e9>   DW_AT_name        : IDR
    <ed>   DW_AT_decl_file   : 5
    <ee>   DW_AT_decl_line   : 305
    <f0>   DW_AT_decl_column : 18
    <f1>   DW_AT_type        : <0x9f>
    <f5>   DW_AT_data_member_location: 4
 <2><f6>: Abbrev Number: 10 (DW_TAG_member)
    <f7>   DW_AT_name        : (indirect string, offset: 0xe28b1): RESERVED0
    <fb>   DW_AT_decl_file   : 5
    <fc>   DW_AT_decl_line   : 306
    <fe>   DW_AT_decl_column : 18
    <ff>   DW_AT_type        : <0x93>
    <103>   DW_AT_data_member_location: 5
 <2><104>: Abbrev Number: 10 (DW_TAG_member)
    <105>   DW_AT_name        : (indirect string, offset: 0xe28bb): RESERVED1
    <109>   DW_AT_decl_file   : 5
    <10a>   DW_AT_decl_line   : 307
    <10c>   DW_AT_decl_column : 18
    <10d>   DW_AT_type        : <0xa4>
    <111>   DW_AT_data_member_location: 6
 <2><112>: Abbrev Number: 9 (DW_TAG_member)
    <113>   DW_AT_name        : CR
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 308
    <119>   DW_AT_decl_column : 18
    <11a>   DW_AT_type        : <0xbc>
    <11e>   DW_AT_data_member_location: 8
 <2><11f>: Abbrev Number: 10 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0xe28c5): RESERVED2
    <124>   DW_AT_decl_file   : 5
    <125>   DW_AT_decl_line   : 309
    <127>   DW_AT_decl_column : 18
    <128>   DW_AT_type        : <0xb0>
    <12c>   DW_AT_data_member_location: 12
 <2><12d>: Abbrev Number: 10 (DW_TAG_member)
    <12e>   DW_AT_name        : (indirect string, offset: 0xc266b): INIT
    <132>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 310
    <135>   DW_AT_decl_column : 18
    <136>   DW_AT_type        : <0xbc>
    <13a>   DW_AT_data_member_location: 16
 <2><13b>: Abbrev Number: 9 (DW_TAG_member)
    <13c>   DW_AT_name        : POL
    <140>   DW_AT_decl_file   : 5
    <141>   DW_AT_decl_line   : 311
    <143>   DW_AT_decl_column : 18
    <144>   DW_AT_type        : <0xbc>
    <148>   DW_AT_data_member_location: 20
 <2><149>: Abbrev Number: 0
 <1><14a>: Abbrev Number: 11 (DW_TAG_typedef)
    <14b>   DW_AT_name        : (indirect string, offset: 0x55a67): CRC_TypeDef
    <14f>   DW_AT_decl_file   : 5
    <150>   DW_AT_decl_line   : 312
    <152>   DW_AT_decl_column : 3
    <153>   DW_AT_type        : <0xd1>
 <1><157>: Abbrev Number: 8 (DW_TAG_structure_type)
    <158>   DW_AT_byte_size   : 24
    <159>   DW_AT_decl_file   : 5
    <15a>   DW_AT_decl_line   : 372
    <15c>   DW_AT_decl_column : 9
    <15d>   DW_AT_sibling     : <0x1b5>
 <2><161>: Abbrev Number: 9 (DW_TAG_member)
    <162>   DW_AT_name        : CR
    <165>   DW_AT_decl_file   : 5
    <166>   DW_AT_decl_line   : 374
    <168>   DW_AT_decl_column : 17
    <169>   DW_AT_type        : <0xbc>
    <16d>   DW_AT_data_member_location: 0
 <2><16e>: Abbrev Number: 10 (DW_TAG_member)
    <16f>   DW_AT_name        : (indirect string, offset: 0x1c38c): NDTR
    <173>   DW_AT_decl_file   : 5
    <174>   DW_AT_decl_line   : 375
    <176>   DW_AT_decl_column : 17
    <177>   DW_AT_type        : <0xbc>
    <17b>   DW_AT_data_member_location: 4
 <2><17c>: Abbrev Number: 9 (DW_TAG_member)
    <17d>   DW_AT_name        : PAR
    <181>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 376
    <184>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xbc>
    <189>   DW_AT_data_member_location: 8
 <2><18a>: Abbrev Number: 10 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x62c24): M0AR
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 377
    <192>   DW_AT_decl_column : 17
    <193>   DW_AT_type        : <0xbc>
    <197>   DW_AT_data_member_location: 12
 <2><198>: Abbrev Number: 10 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x83f03): M1AR
    <19d>   DW_AT_decl_file   : 5
    <19e>   DW_AT_decl_line   : 378
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xbc>
    <1a5>   DW_AT_data_member_location: 16
 <2><1a6>: Abbrev Number: 9 (DW_TAG_member)
    <1a7>   DW_AT_name        : FCR
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 379
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xbc>
    <1b3>   DW_AT_data_member_location: 20
 <2><1b4>: Abbrev Number: 0
 <1><1b5>: Abbrev Number: 11 (DW_TAG_typedef)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x1d3ed): DMA_Stream_TypeDef
    <1ba>   DW_AT_decl_file   : 5
    <1bb>   DW_AT_decl_line   : 380
    <1bd>   DW_AT_decl_column : 3
    <1be>   DW_AT_type        : <0x157>
 <1><1c2>: Abbrev Number: 6 (DW_TAG_array_type)
    <1c3>   DW_AT_type        : <0xbc>
    <1c7>   DW_AT_sibling     : <0x1d2>
 <2><1cb>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1cc>   DW_AT_type        : <0x8c>
    <1d0>   DW_AT_upper_bound : 1
 <2><1d1>: Abbrev Number: 0
 <1><1d2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1d3>   DW_AT_type        : <0x1c2>
 <1><1d7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1d8>   DW_AT_byte_size   : 40
    <1d9>   DW_AT_decl_file   : 5
    <1da>   DW_AT_decl_line   : 579
    <1dc>   DW_AT_decl_column : 9
    <1dd>   DW_AT_sibling     : <0x260>
 <2><1e1>: Abbrev Number: 10 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x1a2b): MODER
    <1e6>   DW_AT_decl_file   : 5
    <1e7>   DW_AT_decl_line   : 581
    <1e9>   DW_AT_decl_column : 17
    <1ea>   DW_AT_type        : <0xbc>
    <1ee>   DW_AT_data_member_location: 0
 <2><1ef>: Abbrev Number: 10 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0xb9e9b): OTYPER
    <1f4>   DW_AT_decl_file   : 5
    <1f5>   DW_AT_decl_line   : 582
    <1f7>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xbc>
    <1fc>   DW_AT_data_member_location: 4
 <2><1fd>: Abbrev Number: 10 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0xd0be2): OSPEEDR
    <202>   DW_AT_decl_file   : 5
    <203>   DW_AT_decl_line   : 583
    <205>   DW_AT_decl_column : 17
    <206>   DW_AT_type        : <0xbc>
    <20a>   DW_AT_data_member_location: 8
 <2><20b>: Abbrev Number: 10 (DW_TAG_member)
    <20c>   DW_AT_name        : (indirect string, offset: 0x9b070): PUPDR
    <210>   DW_AT_decl_file   : 5
    <211>   DW_AT_decl_line   : 584
    <213>   DW_AT_decl_column : 17
    <214>   DW_AT_type        : <0xbc>
    <218>   DW_AT_data_member_location: 12
 <2><219>: Abbrev Number: 9 (DW_TAG_member)
    <21a>   DW_AT_name        : IDR
    <21e>   DW_AT_decl_file   : 5
    <21f>   DW_AT_decl_line   : 585
    <221>   DW_AT_decl_column : 17
    <222>   DW_AT_type        : <0xbc>
    <226>   DW_AT_data_member_location: 16
 <2><227>: Abbrev Number: 9 (DW_TAG_member)
    <228>   DW_AT_name        : ODR
    <22c>   DW_AT_decl_file   : 5
    <22d>   DW_AT_decl_line   : 586
    <22f>   DW_AT_decl_column : 17
    <230>   DW_AT_type        : <0xbc>
    <234>   DW_AT_data_member_location: 20
 <2><235>: Abbrev Number: 10 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x3541f): BSRR
    <23a>   DW_AT_decl_file   : 5
    <23b>   DW_AT_decl_line   : 587
    <23d>   DW_AT_decl_column : 17
    <23e>   DW_AT_type        : <0xbc>
    <242>   DW_AT_data_member_location: 24
 <2><243>: Abbrev Number: 10 (DW_TAG_member)
    <244>   DW_AT_name        : (indirect string, offset: 0xce26f): LCKR
    <248>   DW_AT_decl_file   : 5
    <249>   DW_AT_decl_line   : 588
    <24b>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xbc>
    <250>   DW_AT_data_member_location: 28
 <2><251>: Abbrev Number: 9 (DW_TAG_member)
    <252>   DW_AT_name        : AFR
    <256>   DW_AT_decl_file   : 5
    <257>   DW_AT_decl_line   : 589
    <259>   DW_AT_decl_column : 17
    <25a>   DW_AT_type        : <0x1d2>
    <25e>   DW_AT_data_member_location: 32
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 11 (DW_TAG_typedef)
    <261>   DW_AT_name        : (indirect string, offset: 0xe919c): GPIO_TypeDef
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 590
    <268>   DW_AT_decl_column : 3
    <269>   DW_AT_type        : <0x1d7>
 <1><26d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <26e>   DW_AT_byte_size   : 16
    <26f>   DW_AT_decl_file   : 5
    <270>   DW_AT_decl_line   : 690
    <272>   DW_AT_decl_column : 9
    <273>   DW_AT_sibling     : <0x2b0>
 <2><277>: Abbrev Number: 9 (DW_TAG_member)
    <278>   DW_AT_name        : CR1
    <27c>   DW_AT_decl_file   : 5
    <27d>   DW_AT_decl_line   : 692
    <27f>   DW_AT_decl_column : 17
    <280>   DW_AT_type        : <0xbc>
    <284>   DW_AT_data_member_location: 0
 <2><285>: Abbrev Number: 10 (DW_TAG_member)
    <286>   DW_AT_name        : (indirect string, offset: 0x60f99): CSR1
    <28a>   DW_AT_decl_file   : 5
    <28b>   DW_AT_decl_line   : 693
    <28d>   DW_AT_decl_column : 17
    <28e>   DW_AT_type        : <0xbc>
    <292>   DW_AT_data_member_location: 4
 <2><293>: Abbrev Number: 9 (DW_TAG_member)
    <294>   DW_AT_name        : CR2
    <298>   DW_AT_decl_file   : 5
    <299>   DW_AT_decl_line   : 694
    <29b>   DW_AT_decl_column : 17
    <29c>   DW_AT_type        : <0xbc>
    <2a0>   DW_AT_data_member_location: 8
 <2><2a1>: Abbrev Number: 10 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x60f9e): CSR2
    <2a6>   DW_AT_decl_file   : 5
    <2a7>   DW_AT_decl_line   : 695
    <2a9>   DW_AT_decl_column : 17
    <2aa>   DW_AT_type        : <0xbc>
    <2ae>   DW_AT_data_member_location: 12
 <2><2af>: Abbrev Number: 0
 <1><2b0>: Abbrev Number: 11 (DW_TAG_typedef)
    <2b1>   DW_AT_name        : (indirect string, offset: 0xadae8): PWR_TypeDef
    <2b5>   DW_AT_decl_file   : 5
    <2b6>   DW_AT_decl_line   : 696
    <2b8>   DW_AT_decl_column : 3
    <2b9>   DW_AT_type        : <0x26d>
 <1><2bd>: Abbrev Number: 8 (DW_TAG_structure_type)
    <2be>   DW_AT_byte_size   : 148
    <2bf>   DW_AT_decl_file   : 5
    <2c0>   DW_AT_decl_line   : 703
    <2c2>   DW_AT_decl_column : 9
    <2c3>   DW_AT_sibling     : <0x495>
 <2><2c7>: Abbrev Number: 9 (DW_TAG_member)
    <2c8>   DW_AT_name        : CR
    <2cb>   DW_AT_decl_file   : 5
    <2cc>   DW_AT_decl_line   : 705
    <2ce>   DW_AT_decl_column : 17
    <2cf>   DW_AT_type        : <0xbc>
    <2d3>   DW_AT_data_member_location: 0
 <2><2d4>: Abbrev Number: 10 (DW_TAG_member)
    <2d5>   DW_AT_name        : (indirect string, offset: 0xa824a): PLLCFGR
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 706
    <2dc>   DW_AT_decl_column : 17
    <2dd>   DW_AT_type        : <0xbc>
    <2e1>   DW_AT_data_member_location: 4
 <2><2e2>: Abbrev Number: 10 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x41983): CFGR
    <2e7>   DW_AT_decl_file   : 5
    <2e8>   DW_AT_decl_line   : 707
    <2ea>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0xbc>
    <2ef>   DW_AT_data_member_location: 8
 <2><2f0>: Abbrev Number: 9 (DW_TAG_member)
    <2f1>   DW_AT_name        : CIR
    <2f5>   DW_AT_decl_file   : 5
    <2f6>   DW_AT_decl_line   : 708
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xbc>
    <2fd>   DW_AT_data_member_location: 12
 <2><2fe>: Abbrev Number: 10 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0xbf3fc): AHB1RSTR
    <303>   DW_AT_decl_file   : 5
    <304>   DW_AT_decl_line   : 709
    <306>   DW_AT_decl_column : 17
    <307>   DW_AT_type        : <0xbc>
    <30b>   DW_AT_data_member_location: 16
 <2><30c>: Abbrev Number: 10 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x1b600): AHB2RSTR
    <311>   DW_AT_decl_file   : 5
    <312>   DW_AT_decl_line   : 710
    <314>   DW_AT_decl_column : 17
    <315>   DW_AT_type        : <0xbc>
    <319>   DW_AT_data_member_location: 20
 <2><31a>: Abbrev Number: 10 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0x67989): AHB3RSTR
    <31f>   DW_AT_decl_file   : 5
    <320>   DW_AT_decl_line   : 711
    <322>   DW_AT_decl_column : 17
    <323>   DW_AT_type        : <0xbc>
    <327>   DW_AT_data_member_location: 24
 <2><328>: Abbrev Number: 10 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0xe28b1): RESERVED0
    <32d>   DW_AT_decl_file   : 5
    <32e>   DW_AT_decl_line   : 712
    <330>   DW_AT_decl_column : 17
    <331>   DW_AT_type        : <0xb0>
    <335>   DW_AT_data_member_location: 28
 <2><336>: Abbrev Number: 10 (DW_TAG_member)
    <337>   DW_AT_name        : (indirect string, offset: 0x1b153): APB1RSTR
    <33b>   DW_AT_decl_file   : 5
    <33c>   DW_AT_decl_line   : 713
    <33e>   DW_AT_decl_column : 17
    <33f>   DW_AT_type        : <0xbc>
    <343>   DW_AT_data_member_location: 32
 <2><344>: Abbrev Number: 10 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0x672ed): APB2RSTR
    <349>   DW_AT_decl_file   : 5
    <34a>   DW_AT_decl_line   : 714
    <34c>   DW_AT_decl_column : 17
    <34d>   DW_AT_type        : <0xbc>
    <351>   DW_AT_data_member_location: 36
 <2><352>: Abbrev Number: 10 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0xe28bb): RESERVED1
    <357>   DW_AT_decl_file   : 5
    <358>   DW_AT_decl_line   : 715
    <35a>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0xc1>
    <35f>   DW_AT_data_member_location: 40
 <2><360>: Abbrev Number: 10 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x1361d): AHB1ENR
    <365>   DW_AT_decl_file   : 5
    <366>   DW_AT_decl_line   : 716
    <368>   DW_AT_decl_column : 17
    <369>   DW_AT_type        : <0xbc>
    <36d>   DW_AT_data_member_location: 48
 <2><36e>: Abbrev Number: 10 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x3ee43): AHB2ENR
    <373>   DW_AT_decl_file   : 5
    <374>   DW_AT_decl_line   : 717
    <376>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0xbc>
    <37b>   DW_AT_data_member_location: 52
 <2><37c>: Abbrev Number: 10 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x6a94c): AHB3ENR
    <381>   DW_AT_decl_file   : 5
    <382>   DW_AT_decl_line   : 718
    <384>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xbc>
    <389>   DW_AT_data_member_location: 56
 <2><38a>: Abbrev Number: 10 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0xe28c5): RESERVED2
    <38f>   DW_AT_decl_file   : 5
    <390>   DW_AT_decl_line   : 719
    <392>   DW_AT_decl_column : 17
    <393>   DW_AT_type        : <0xb0>
    <397>   DW_AT_data_member_location: 60
 <2><398>: Abbrev Number: 10 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x89363): APB1ENR
    <39d>   DW_AT_decl_file   : 5
    <39e>   DW_AT_decl_line   : 720
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xbc>
    <3a5>   DW_AT_data_member_location: 64
 <2><3a6>: Abbrev Number: 10 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x1c695): APB2ENR
    <3ab>   DW_AT_decl_file   : 5
    <3ac>   DW_AT_decl_line   : 721
    <3ae>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0xbc>
    <3b3>   DW_AT_data_member_location: 68
 <2><3b4>: Abbrev Number: 10 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0xe28cf): RESERVED3
    <3b9>   DW_AT_decl_file   : 5
    <3ba>   DW_AT_decl_line   : 722
    <3bc>   DW_AT_decl_column : 17
    <3bd>   DW_AT_type        : <0xc1>
    <3c1>   DW_AT_data_member_location: 72
 <2><3c2>: Abbrev Number: 10 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0xc3e67): AHB1LPENR
    <3c7>   DW_AT_decl_file   : 5
    <3c8>   DW_AT_decl_line   : 723
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0xbc>
    <3cf>   DW_AT_data_member_location: 80
 <2><3d0>: Abbrev Number: 10 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x34f55): AHB2LPENR
    <3d5>   DW_AT_decl_file   : 5
    <3d6>   DW_AT_decl_line   : 724
    <3d8>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xbc>
    <3dd>   DW_AT_data_member_location: 84
 <2><3de>: Abbrev Number: 10 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0xa2571): AHB3LPENR
    <3e3>   DW_AT_decl_file   : 5
    <3e4>   DW_AT_decl_line   : 725
    <3e6>   DW_AT_decl_column : 17
    <3e7>   DW_AT_type        : <0xbc>
    <3eb>   DW_AT_data_member_location: 88
 <2><3ec>: Abbrev Number: 10 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0xe28d9): RESERVED4
    <3f1>   DW_AT_decl_file   : 5
    <3f2>   DW_AT_decl_line   : 726
    <3f4>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xb0>
    <3f9>   DW_AT_data_member_location: 92
 <2><3fa>: Abbrev Number: 10 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xc970c): APB1LPENR
    <3ff>   DW_AT_decl_file   : 5
    <400>   DW_AT_decl_line   : 727
    <402>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0xbc>
    <407>   DW_AT_data_member_location: 96
 <2><408>: Abbrev Number: 10 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x274f6): APB2LPENR
    <40d>   DW_AT_decl_file   : 5
    <40e>   DW_AT_decl_line   : 728
    <410>   DW_AT_decl_column : 17
    <411>   DW_AT_type        : <0xbc>
    <415>   DW_AT_data_member_location: 100
 <2><416>: Abbrev Number: 10 (DW_TAG_member)
    <417>   DW_AT_name        : (indirect string, offset: 0xe28e3): RESERVED5
    <41b>   DW_AT_decl_file   : 5
    <41c>   DW_AT_decl_line   : 729
    <41e>   DW_AT_decl_column : 17
    <41f>   DW_AT_type        : <0xc1>
    <423>   DW_AT_data_member_location: 104
 <2><424>: Abbrev Number: 10 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x21144): BDCR
    <429>   DW_AT_decl_file   : 5
    <42a>   DW_AT_decl_line   : 730
    <42c>   DW_AT_decl_column : 17
    <42d>   DW_AT_type        : <0xbc>
    <431>   DW_AT_data_member_location: 112
 <2><432>: Abbrev Number: 9 (DW_TAG_member)
    <433>   DW_AT_name        : CSR
    <437>   DW_AT_decl_file   : 5
    <438>   DW_AT_decl_line   : 731
    <43a>   DW_AT_decl_column : 17
    <43b>   DW_AT_type        : <0xbc>
    <43f>   DW_AT_data_member_location: 116
 <2><440>: Abbrev Number: 10 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0x8e243): RESERVED6
    <445>   DW_AT_decl_file   : 5
    <446>   DW_AT_decl_line   : 732
    <448>   DW_AT_decl_column : 17
    <449>   DW_AT_type        : <0xc1>
    <44d>   DW_AT_data_member_location: 120
 <2><44e>: Abbrev Number: 10 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0x7e3c9): SSCGR
    <453>   DW_AT_decl_file   : 5
    <454>   DW_AT_decl_line   : 733
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0xbc>
    <45b>   DW_AT_data_member_location: 128
 <2><45c>: Abbrev Number: 10 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x4e840): PLLI2SCFGR
    <461>   DW_AT_decl_file   : 5
    <462>   DW_AT_decl_line   : 734
    <464>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0xbc>
    <469>   DW_AT_data_member_location: 132
 <2><46a>: Abbrev Number: 10 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x4197d): PLLSAICFGR
    <46f>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 735
    <472>   DW_AT_decl_column : 17
    <473>   DW_AT_type        : <0xbc>
    <477>   DW_AT_data_member_location: 136
 <2><478>: Abbrev Number: 10 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x17eb8): DCKCFGR1
    <47d>   DW_AT_decl_file   : 5
    <47e>   DW_AT_decl_line   : 736
    <480>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0xbc>
    <485>   DW_AT_data_member_location: 140
 <2><486>: Abbrev Number: 10 (DW_TAG_member)
    <487>   DW_AT_name        : (indirect string, offset: 0xa6b25): DCKCFGR2
    <48b>   DW_AT_decl_file   : 5
    <48c>   DW_AT_decl_line   : 737
    <48e>   DW_AT_decl_column : 17
    <48f>   DW_AT_type        : <0xbc>
    <493>   DW_AT_data_member_location: 144
 <2><494>: Abbrev Number: 0
 <1><495>: Abbrev Number: 11 (DW_TAG_typedef)
    <496>   DW_AT_name        : (indirect string, offset: 0x6dec5): RCC_TypeDef
    <49a>   DW_AT_decl_file   : 5
    <49b>   DW_AT_decl_line   : 739
    <49d>   DW_AT_decl_column : 3
    <49e>   DW_AT_type        : <0x2bd>
 <1><4a2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <4a3>   DW_AT_byte_size   : 96
    <4a4>   DW_AT_decl_file   : 5
    <4a5>   DW_AT_decl_line   : 908
    <4a7>   DW_AT_decl_column : 9
    <4a8>   DW_AT_sibling     : <0x5fb>
 <2><4ac>: Abbrev Number: 9 (DW_TAG_member)
    <4ad>   DW_AT_name        : CR1
    <4b1>   DW_AT_decl_file   : 5
    <4b2>   DW_AT_decl_line   : 910
    <4b4>   DW_AT_decl_column : 17
    <4b5>   DW_AT_type        : <0xbc>
    <4b9>   DW_AT_data_member_location: 0
 <2><4ba>: Abbrev Number: 9 (DW_TAG_member)
    <4bb>   DW_AT_name        : CR2
    <4bf>   DW_AT_decl_file   : 5
    <4c0>   DW_AT_decl_line   : 911
    <4c2>   DW_AT_decl_column : 17
    <4c3>   DW_AT_type        : <0xbc>
    <4c7>   DW_AT_data_member_location: 4
 <2><4c8>: Abbrev Number: 10 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x4593f): SMCR
    <4cd>   DW_AT_decl_file   : 5
    <4ce>   DW_AT_decl_line   : 912
    <4d0>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0xbc>
    <4d5>   DW_AT_data_member_location: 8
 <2><4d6>: Abbrev Number: 10 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x4c7b4): DIER
    <4db>   DW_AT_decl_file   : 5
    <4dc>   DW_AT_decl_line   : 913
    <4de>   DW_AT_decl_column : 17
    <4df>   DW_AT_type        : <0xbc>
    <4e3>   DW_AT_data_member_location: 12
 <2><4e4>: Abbrev Number: 9 (DW_TAG_member)
    <4e5>   DW_AT_name        : SR
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 914
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0xbc>
    <4f0>   DW_AT_data_member_location: 16
 <2><4f1>: Abbrev Number: 9 (DW_TAG_member)
    <4f2>   DW_AT_name        : EGR
    <4f6>   DW_AT_decl_file   : 5
    <4f7>   DW_AT_decl_line   : 915
    <4f9>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0xbc>
    <4fe>   DW_AT_data_member_location: 20
 <2><4ff>: Abbrev Number: 10 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x83919): CCMR1
    <504>   DW_AT_decl_file   : 5
    <505>   DW_AT_decl_line   : 916
    <507>   DW_AT_decl_column : 17
    <508>   DW_AT_type        : <0xbc>
    <50c>   DW_AT_data_member_location: 24
 <2><50d>: Abbrev Number: 10 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x1b627): CCMR2
    <512>   DW_AT_decl_file   : 5
    <513>   DW_AT_decl_line   : 917
    <515>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0xbc>
    <51a>   DW_AT_data_member_location: 28
 <2><51b>: Abbrev Number: 10 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0x396ba): CCER
    <520>   DW_AT_decl_file   : 5
    <521>   DW_AT_decl_line   : 918
    <523>   DW_AT_decl_column : 17
    <524>   DW_AT_type        : <0xbc>
    <528>   DW_AT_data_member_location: 32
 <2><529>: Abbrev Number: 9 (DW_TAG_member)
    <52a>   DW_AT_name        : CNT
    <52e>   DW_AT_decl_file   : 5
    <52f>   DW_AT_decl_line   : 919
    <531>   DW_AT_decl_column : 17
    <532>   DW_AT_type        : <0xbc>
    <536>   DW_AT_data_member_location: 36
 <2><537>: Abbrev Number: 9 (DW_TAG_member)
    <538>   DW_AT_name        : PSC
    <53c>   DW_AT_decl_file   : 5
    <53d>   DW_AT_decl_line   : 920
    <53f>   DW_AT_decl_column : 17
    <540>   DW_AT_type        : <0xbc>
    <544>   DW_AT_data_member_location: 40
 <2><545>: Abbrev Number: 9 (DW_TAG_member)
    <546>   DW_AT_name        : ARR
    <54a>   DW_AT_decl_file   : 5
    <54b>   DW_AT_decl_line   : 921
    <54d>   DW_AT_decl_column : 17
    <54e>   DW_AT_type        : <0xbc>
    <552>   DW_AT_data_member_location: 44
 <2><553>: Abbrev Number: 9 (DW_TAG_member)
    <554>   DW_AT_name        : RCR
    <558>   DW_AT_decl_file   : 5
    <559>   DW_AT_decl_line   : 922
    <55b>   DW_AT_decl_column : 17
    <55c>   DW_AT_type        : <0xbc>
    <560>   DW_AT_data_member_location: 48
 <2><561>: Abbrev Number: 10 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x1c690): CCR1
    <566>   DW_AT_decl_file   : 5
    <567>   DW_AT_decl_line   : 923
    <569>   DW_AT_decl_column : 17
    <56a>   DW_AT_type        : <0xbc>
    <56e>   DW_AT_data_member_location: 52
 <2><56f>: Abbrev Number: 10 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x63ccf): CCR2
    <574>   DW_AT_decl_file   : 5
    <575>   DW_AT_decl_line   : 924
    <577>   DW_AT_decl_column : 17
    <578>   DW_AT_type        : <0xbc>
    <57c>   DW_AT_data_member_location: 56
 <2><57d>: Abbrev Number: 10 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x43c79): CCR3
    <582>   DW_AT_decl_file   : 5
    <583>   DW_AT_decl_line   : 925
    <585>   DW_AT_decl_column : 17
    <586>   DW_AT_type        : <0xbc>
    <58a>   DW_AT_data_member_location: 60
 <2><58b>: Abbrev Number: 10 (DW_TAG_member)
    <58c>   DW_AT_name        : (indirect string, offset: 0xee48): CCR4
    <590>   DW_AT_decl_file   : 5
    <591>   DW_AT_decl_line   : 926
    <593>   DW_AT_decl_column : 17
    <594>   DW_AT_type        : <0xbc>
    <598>   DW_AT_data_member_location: 64
 <2><599>: Abbrev Number: 10 (DW_TAG_member)
    <59a>   DW_AT_name        : (indirect string, offset: 0xa3e45): BDTR
    <59e>   DW_AT_decl_file   : 5
    <59f>   DW_AT_decl_line   : 927
    <5a1>   DW_AT_decl_column : 17
    <5a2>   DW_AT_type        : <0xbc>
    <5a6>   DW_AT_data_member_location: 68
 <2><5a7>: Abbrev Number: 9 (DW_TAG_member)
    <5a8>   DW_AT_name        : DCR
    <5ac>   DW_AT_decl_file   : 5
    <5ad>   DW_AT_decl_line   : 928
    <5af>   DW_AT_decl_column : 17
    <5b0>   DW_AT_type        : <0xbc>
    <5b4>   DW_AT_data_member_location: 72
 <2><5b5>: Abbrev Number: 10 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xce960): DMAR
    <5ba>   DW_AT_decl_file   : 5
    <5bb>   DW_AT_decl_line   : 929
    <5bd>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0xbc>
    <5c2>   DW_AT_data_member_location: 76
 <2><5c3>: Abbrev Number: 9 (DW_TAG_member)
    <5c4>   DW_AT_name        : OR
    <5c7>   DW_AT_decl_file   : 5
    <5c8>   DW_AT_decl_line   : 930
    <5ca>   DW_AT_decl_column : 17
    <5cb>   DW_AT_type        : <0xbc>
    <5cf>   DW_AT_data_member_location: 80
 <2><5d0>: Abbrev Number: 10 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0xd5f05): CCMR3
    <5d5>   DW_AT_decl_file   : 5
    <5d6>   DW_AT_decl_line   : 931
    <5d8>   DW_AT_decl_column : 17
    <5d9>   DW_AT_type        : <0xbc>
    <5dd>   DW_AT_data_member_location: 84
 <2><5de>: Abbrev Number: 10 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x55d0b): CCR5
    <5e3>   DW_AT_decl_file   : 5
    <5e4>   DW_AT_decl_line   : 932
    <5e6>   DW_AT_decl_column : 17
    <5e7>   DW_AT_type        : <0xbc>
    <5eb>   DW_AT_data_member_location: 88
 <2><5ec>: Abbrev Number: 10 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xa9981): CCR6
    <5f1>   DW_AT_decl_file   : 5
    <5f2>   DW_AT_decl_line   : 933
    <5f4>   DW_AT_decl_column : 17
    <5f5>   DW_AT_type        : <0xbc>
    <5f9>   DW_AT_data_member_location: 92
 <2><5fa>: Abbrev Number: 0
 <1><5fb>: Abbrev Number: 11 (DW_TAG_typedef)
    <5fc>   DW_AT_name        : (indirect string, offset: 0xe359d): TIM_TypeDef
    <600>   DW_AT_decl_file   : 5
    <601>   DW_AT_decl_line   : 935
    <603>   DW_AT_decl_column : 3
    <604>   DW_AT_type        : <0x4a2>
 <1><608>: Abbrev Number: 2 (DW_TAG_base_type)
    <609>   DW_AT_byte_size   : 8
    <60a>   DW_AT_encoding    : 4	(float)
    <60b>   DW_AT_name        : (indirect string, offset: 0x160cd): long double
 <1><60f>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <610>   DW_AT_encoding    : 7	(unsigned)
    <611>   DW_AT_byte_size   : 1
    <612>   DW_AT_type        : <0x3c>
    <616>   DW_AT_decl_file   : 6
    <617>   DW_AT_decl_line   : 39
    <618>   DW_AT_decl_column : 1
    <619>   DW_AT_sibling     : <0x636>
 <2><61d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <61e>   DW_AT_name        : (indirect string, offset: 0x4fd81): HAL_OK
    <622>   DW_AT_const_value : 0
 <2><623>: Abbrev Number: 13 (DW_TAG_enumerator)
    <624>   DW_AT_name        : (indirect string, offset: 0x95268): HAL_ERROR
    <628>   DW_AT_const_value : 1
 <2><629>: Abbrev Number: 13 (DW_TAG_enumerator)
    <62a>   DW_AT_name        : (indirect string, offset: 0x29930): HAL_BUSY
    <62e>   DW_AT_const_value : 2
 <2><62f>: Abbrev Number: 13 (DW_TAG_enumerator)
    <630>   DW_AT_name        : (indirect string, offset: 0x4584f): HAL_TIMEOUT
    <634>   DW_AT_const_value : 3
 <2><635>: Abbrev Number: 0
 <1><636>: Abbrev Number: 3 (DW_TAG_typedef)
    <637>   DW_AT_name        : (indirect string, offset: 0x2af9): HAL_StatusTypeDef
    <63b>   DW_AT_decl_file   : 6
    <63c>   DW_AT_decl_line   : 44
    <63d>   DW_AT_decl_column : 3
    <63e>   DW_AT_type        : <0x60f>
 <1><642>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <643>   DW_AT_encoding    : 7	(unsigned)
    <644>   DW_AT_byte_size   : 1
    <645>   DW_AT_type        : <0x3c>
    <649>   DW_AT_decl_file   : 6
    <64a>   DW_AT_decl_line   : 50
    <64b>   DW_AT_decl_column : 1
    <64c>   DW_AT_sibling     : <0x65d>
 <2><650>: Abbrev Number: 13 (DW_TAG_enumerator)
    <651>   DW_AT_name        : (indirect string, offset: 0xb1a1e): HAL_UNLOCKED
    <655>   DW_AT_const_value : 0
 <2><656>: Abbrev Number: 13 (DW_TAG_enumerator)
    <657>   DW_AT_name        : (indirect string, offset: 0xefc1c): HAL_LOCKED
    <65b>   DW_AT_const_value : 1
 <2><65c>: Abbrev Number: 0
 <1><65d>: Abbrev Number: 3 (DW_TAG_typedef)
    <65e>   DW_AT_name        : (indirect string, offset: 0x8d010): HAL_LockTypeDef
    <662>   DW_AT_decl_file   : 6
    <663>   DW_AT_decl_line   : 53
    <664>   DW_AT_decl_column : 3
    <665>   DW_AT_type        : <0x642>
 <1><669>: Abbrev Number: 14 (DW_TAG_structure_type)
    <66a>   DW_AT_byte_size   : 24
    <66b>   DW_AT_decl_file   : 7
    <66c>   DW_AT_decl_line   : 45
    <66d>   DW_AT_decl_column : 9
    <66e>   DW_AT_sibling     : <0x6c1>
 <2><672>: Abbrev Number: 15 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0xa109a): PLLState
    <677>   DW_AT_decl_file   : 7
    <678>   DW_AT_decl_line   : 47
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xb0>
    <67e>   DW_AT_data_member_location: 0
 <2><67f>: Abbrev Number: 15 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0xa6d54): PLLSource
    <684>   DW_AT_decl_file   : 7
    <685>   DW_AT_decl_line   : 50
    <686>   DW_AT_decl_column : 12
    <687>   DW_AT_type        : <0xb0>
    <68b>   DW_AT_data_member_location: 4
 <2><68c>: Abbrev Number: 15 (DW_TAG_member)
    <68d>   DW_AT_name        : (indirect string, offset: 0xc6aba): PLLM
    <691>   DW_AT_decl_file   : 7
    <692>   DW_AT_decl_line   : 53
    <693>   DW_AT_decl_column : 12
    <694>   DW_AT_type        : <0xb0>
    <698>   DW_AT_data_member_location: 8
 <2><699>: Abbrev Number: 15 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0xc6abf): PLLN
    <69e>   DW_AT_decl_file   : 7
    <69f>   DW_AT_decl_line   : 56
    <6a0>   DW_AT_decl_column : 12
    <6a1>   DW_AT_type        : <0xb0>
    <6a5>   DW_AT_data_member_location: 12
 <2><6a6>: Abbrev Number: 15 (DW_TAG_member)
    <6a7>   DW_AT_name        : (indirect string, offset: 0xc6adc): PLLP
    <6ab>   DW_AT_decl_file   : 7
    <6ac>   DW_AT_decl_line   : 59
    <6ad>   DW_AT_decl_column : 12
    <6ae>   DW_AT_type        : <0xb0>
    <6b2>   DW_AT_data_member_location: 16
 <2><6b3>: Abbrev Number: 15 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x668e8): PLLQ
    <6b8>   DW_AT_decl_file   : 7
    <6b9>   DW_AT_decl_line   : 62
    <6ba>   DW_AT_decl_column : 12
    <6bb>   DW_AT_type        : <0xb0>
    <6bf>   DW_AT_data_member_location: 20
 <2><6c0>: Abbrev Number: 0
 <1><6c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x905f9): RCC_PLLInitTypeDef
    <6c6>   DW_AT_decl_file   : 7
    <6c7>   DW_AT_decl_line   : 69
    <6c8>   DW_AT_decl_column : 2
    <6c9>   DW_AT_type        : <0x669>
 <1><6cd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6ce>   DW_AT_byte_size   : 48
    <6cf>   DW_AT_decl_file   : 8
    <6d0>   DW_AT_decl_line   : 50
    <6d1>   DW_AT_decl_column : 9
    <6d2>   DW_AT_sibling     : <0x732>
 <2><6d6>: Abbrev Number: 15 (DW_TAG_member)
    <6d7>   DW_AT_name        : (indirect string, offset: 0xc36fc): OscillatorType
    <6db>   DW_AT_decl_file   : 8
    <6dc>   DW_AT_decl_line   : 52
    <6dd>   DW_AT_decl_column : 12
    <6de>   DW_AT_type        : <0xb0>
    <6e2>   DW_AT_data_member_location: 0
 <2><6e3>: Abbrev Number: 15 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xa2e71): HSEState
    <6e8>   DW_AT_decl_file   : 8
    <6e9>   DW_AT_decl_line   : 55
    <6ea>   DW_AT_decl_column : 12
    <6eb>   DW_AT_type        : <0xb0>
    <6ef>   DW_AT_data_member_location: 4
 <2><6f0>: Abbrev Number: 15 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x95fdd): LSEState
    <6f5>   DW_AT_decl_file   : 8
    <6f6>   DW_AT_decl_line   : 58
    <6f7>   DW_AT_decl_column : 12
    <6f8>   DW_AT_type        : <0xb0>
    <6fc>   DW_AT_data_member_location: 8
 <2><6fd>: Abbrev Number: 15 (DW_TAG_member)
    <6fe>   DW_AT_name        : (indirect string, offset: 0x69fdb): HSIState
    <702>   DW_AT_decl_file   : 8
    <703>   DW_AT_decl_line   : 61
    <704>   DW_AT_decl_column : 12
    <705>   DW_AT_type        : <0xb0>
    <709>   DW_AT_data_member_location: 12
 <2><70a>: Abbrev Number: 15 (DW_TAG_member)
    <70b>   DW_AT_name        : (indirect string, offset: 0xcebfb): HSICalibrationValue
    <70f>   DW_AT_decl_file   : 8
    <710>   DW_AT_decl_line   : 64
    <711>   DW_AT_decl_column : 12
    <712>   DW_AT_type        : <0xb0>
    <716>   DW_AT_data_member_location: 16
 <2><717>: Abbrev Number: 15 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0x52d12): LSIState
    <71c>   DW_AT_decl_file   : 8
    <71d>   DW_AT_decl_line   : 67
    <71e>   DW_AT_decl_column : 12
    <71f>   DW_AT_type        : <0xb0>
    <723>   DW_AT_data_member_location: 20
 <2><724>: Abbrev Number: 16 (DW_TAG_member)
    <725>   DW_AT_name        : PLL
    <729>   DW_AT_decl_file   : 8
    <72a>   DW_AT_decl_line   : 70
    <72b>   DW_AT_decl_column : 22
    <72c>   DW_AT_type        : <0x6c1>
    <730>   DW_AT_data_member_location: 24
 <2><731>: Abbrev Number: 0
 <1><732>: Abbrev Number: 3 (DW_TAG_typedef)
    <733>   DW_AT_name        : (indirect string, offset: 0x7e982): RCC_OscInitTypeDef
    <737>   DW_AT_decl_file   : 8
    <738>   DW_AT_decl_line   : 72
    <739>   DW_AT_decl_column : 2
    <73a>   DW_AT_type        : <0x6cd>
 <1><73e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <73f>   DW_AT_byte_size   : 20
    <740>   DW_AT_decl_file   : 8
    <741>   DW_AT_decl_line   : 77
    <742>   DW_AT_decl_column : 9
    <743>   DW_AT_sibling     : <0x789>
 <2><747>: Abbrev Number: 15 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x489e8): ClockType
    <74c>   DW_AT_decl_file   : 8
    <74d>   DW_AT_decl_line   : 79
    <74e>   DW_AT_decl_column : 12
    <74f>   DW_AT_type        : <0xb0>
    <753>   DW_AT_data_member_location: 0
 <2><754>: Abbrev Number: 15 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0x90188): SYSCLKSource
    <759>   DW_AT_decl_file   : 8
    <75a>   DW_AT_decl_line   : 82
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_type        : <0xb0>
    <760>   DW_AT_data_member_location: 4
 <2><761>: Abbrev Number: 15 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0xc6406): AHBCLKDivider
    <766>   DW_AT_decl_file   : 8
    <767>   DW_AT_decl_line   : 85
    <768>   DW_AT_decl_column : 12
    <769>   DW_AT_type        : <0xb0>
    <76d>   DW_AT_data_member_location: 8
 <2><76e>: Abbrev Number: 15 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x93d4): APB1CLKDivider
    <773>   DW_AT_decl_file   : 8
    <774>   DW_AT_decl_line   : 88
    <775>   DW_AT_decl_column : 12
    <776>   DW_AT_type        : <0xb0>
    <77a>   DW_AT_data_member_location: 12
 <2><77b>: Abbrev Number: 15 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x6ccda): APB2CLKDivider
    <780>   DW_AT_decl_file   : 8
    <781>   DW_AT_decl_line   : 91
    <782>   DW_AT_decl_column : 12
    <783>   DW_AT_type        : <0xb0>
    <787>   DW_AT_data_member_location: 16
 <2><788>: Abbrev Number: 0
 <1><789>: Abbrev Number: 3 (DW_TAG_typedef)
    <78a>   DW_AT_name        : (indirect string, offset: 0xb9688): RCC_ClkInitTypeDef
    <78e>   DW_AT_decl_file   : 8
    <78f>   DW_AT_decl_line   : 94
    <790>   DW_AT_decl_column : 2
    <791>   DW_AT_type        : <0x73e>
 <1><795>: Abbrev Number: 14 (DW_TAG_structure_type)
    <796>   DW_AT_byte_size   : 20
    <797>   DW_AT_decl_file   : 9
    <798>   DW_AT_decl_line   : 46
    <799>   DW_AT_decl_column : 9
    <79a>   DW_AT_sibling     : <0x7e0>
 <2><79e>: Abbrev Number: 16 (DW_TAG_member)
    <79f>   DW_AT_name        : Pin
    <7a3>   DW_AT_decl_file   : 9
    <7a4>   DW_AT_decl_line   : 48
    <7a5>   DW_AT_decl_column : 12
    <7a6>   DW_AT_type        : <0xb0>
    <7aa>   DW_AT_data_member_location: 0
 <2><7ab>: Abbrev Number: 15 (DW_TAG_member)
    <7ac>   DW_AT_name        : (indirect string, offset: 0xf567c): Mode
    <7b0>   DW_AT_decl_file   : 9
    <7b1>   DW_AT_decl_line   : 51
    <7b2>   DW_AT_decl_column : 12
    <7b3>   DW_AT_type        : <0xb0>
    <7b7>   DW_AT_data_member_location: 4
 <2><7b8>: Abbrev Number: 15 (DW_TAG_member)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x7a77f): Pull
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 54
    <7bf>   DW_AT_decl_column : 12
    <7c0>   DW_AT_type        : <0xb0>
    <7c4>   DW_AT_data_member_location: 8
 <2><7c5>: Abbrev Number: 15 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0xf663d): Speed
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 57
    <7cc>   DW_AT_decl_column : 12
    <7cd>   DW_AT_type        : <0xb0>
    <7d1>   DW_AT_data_member_location: 12
 <2><7d2>: Abbrev Number: 15 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x6cc9b): Alternate
    <7d7>   DW_AT_decl_file   : 9
    <7d8>   DW_AT_decl_line   : 60
    <7d9>   DW_AT_decl_column : 12
    <7da>   DW_AT_type        : <0xb0>
    <7de>   DW_AT_data_member_location: 16
 <2><7df>: Abbrev Number: 0
 <1><7e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xbc012): GPIO_InitTypeDef
    <7e5>   DW_AT_decl_file   : 9
    <7e6>   DW_AT_decl_line   : 62
    <7e7>   DW_AT_decl_column : 2
    <7e8>   DW_AT_type        : <0x795>
 <1><7ec>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <7ed>   DW_AT_encoding    : 7	(unsigned)
    <7ee>   DW_AT_byte_size   : 1
    <7ef>   DW_AT_type        : <0x3c>
    <7f3>   DW_AT_decl_file   : 9
    <7f4>   DW_AT_decl_line   : 68
    <7f5>   DW_AT_decl_column : 1
    <7f6>   DW_AT_sibling     : <0x807>
 <2><7fa>: Abbrev Number: 13 (DW_TAG_enumerator)
    <7fb>   DW_AT_name        : (indirect string, offset: 0x30ee6): GPIO_PIN_RESET
    <7ff>   DW_AT_const_value : 0
 <2><800>: Abbrev Number: 13 (DW_TAG_enumerator)
    <801>   DW_AT_name        : (indirect string, offset: 0x29e50): GPIO_PIN_SET
    <805>   DW_AT_const_value : 1
 <2><806>: Abbrev Number: 0
 <1><807>: Abbrev Number: 3 (DW_TAG_typedef)
    <808>   DW_AT_name        : (indirect string, offset: 0xebff1): GPIO_PinState
    <80c>   DW_AT_decl_file   : 9
    <80d>   DW_AT_decl_line   : 71
    <80e>   DW_AT_decl_column : 2
    <80f>   DW_AT_type        : <0x7ec>
 <1><813>: Abbrev Number: 14 (DW_TAG_structure_type)
    <814>   DW_AT_byte_size   : 48
    <815>   DW_AT_decl_file   : 10
    <816>   DW_AT_decl_line   : 48
    <817>   DW_AT_decl_column : 9
    <818>   DW_AT_sibling     : <0x8b9>
 <2><81c>: Abbrev Number: 15 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x7bd16): Channel
    <821>   DW_AT_decl_file   : 10
    <822>   DW_AT_decl_line   : 50
    <823>   DW_AT_decl_column : 12
    <824>   DW_AT_type        : <0xb0>
    <828>   DW_AT_data_member_location: 0
 <2><829>: Abbrev Number: 15 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x57f2f): Direction
    <82e>   DW_AT_decl_file   : 10
    <82f>   DW_AT_decl_line   : 53
    <830>   DW_AT_decl_column : 12
    <831>   DW_AT_type        : <0xb0>
    <835>   DW_AT_data_member_location: 4
 <2><836>: Abbrev Number: 15 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0xfc99): PeriphInc
    <83b>   DW_AT_decl_file   : 10
    <83c>   DW_AT_decl_line   : 57
    <83d>   DW_AT_decl_column : 12
    <83e>   DW_AT_type        : <0xb0>
    <842>   DW_AT_data_member_location: 8
 <2><843>: Abbrev Number: 15 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x2550d): MemInc
    <848>   DW_AT_decl_file   : 10
    <849>   DW_AT_decl_line   : 60
    <84a>   DW_AT_decl_column : 12
    <84b>   DW_AT_type        : <0xb0>
    <84f>   DW_AT_data_member_location: 12
 <2><850>: Abbrev Number: 15 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x76407): PeriphDataAlignment
    <855>   DW_AT_decl_file   : 10
    <856>   DW_AT_decl_line   : 63
    <857>   DW_AT_decl_column : 12
    <858>   DW_AT_type        : <0xb0>
    <85c>   DW_AT_data_member_location: 16
 <2><85d>: Abbrev Number: 15 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0xd93ad): MemDataAlignment
    <862>   DW_AT_decl_file   : 10
    <863>   DW_AT_decl_line   : 66
    <864>   DW_AT_decl_column : 12
    <865>   DW_AT_type        : <0xb0>
    <869>   DW_AT_data_member_location: 20
 <2><86a>: Abbrev Number: 15 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0xf567c): Mode
    <86f>   DW_AT_decl_file   : 10
    <870>   DW_AT_decl_line   : 69
    <871>   DW_AT_decl_column : 12
    <872>   DW_AT_type        : <0xb0>
    <876>   DW_AT_data_member_location: 24
 <2><877>: Abbrev Number: 15 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xf3b30): Priority
    <87c>   DW_AT_decl_file   : 10
    <87d>   DW_AT_decl_line   : 74
    <87e>   DW_AT_decl_column : 12
    <87f>   DW_AT_type        : <0xb0>
    <883>   DW_AT_data_member_location: 28
 <2><884>: Abbrev Number: 15 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x66adc): FIFOMode
    <889>   DW_AT_decl_file   : 10
    <88a>   DW_AT_decl_line   : 77
    <88b>   DW_AT_decl_column : 12
    <88c>   DW_AT_type        : <0xb0>
    <890>   DW_AT_data_member_location: 32
 <2><891>: Abbrev Number: 15 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0xb6975): FIFOThreshold
    <896>   DW_AT_decl_file   : 10
    <897>   DW_AT_decl_line   : 82
    <898>   DW_AT_decl_column : 12
    <899>   DW_AT_type        : <0xb0>
    <89d>   DW_AT_data_member_location: 36
 <2><89e>: Abbrev Number: 15 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0xb4366): MemBurst
    <8a3>   DW_AT_decl_file   : 10
    <8a4>   DW_AT_decl_line   : 85
    <8a5>   DW_AT_decl_column : 12
    <8a6>   DW_AT_type        : <0xb0>
    <8aa>   DW_AT_data_member_location: 40
 <2><8ab>: Abbrev Number: 15 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x51210): PeriphBurst
    <8b0>   DW_AT_decl_file   : 10
    <8b1>   DW_AT_decl_line   : 91
    <8b2>   DW_AT_decl_column : 12
    <8b3>   DW_AT_type        : <0xb0>
    <8b7>   DW_AT_data_member_location: 44
 <2><8b8>: Abbrev Number: 0
 <1><8b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x3fbd0): DMA_InitTypeDef
    <8be>   DW_AT_decl_file   : 10
    <8bf>   DW_AT_decl_line   : 96
    <8c0>   DW_AT_decl_column : 2
    <8c1>   DW_AT_type        : <0x813>
 <1><8c5>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <8c6>   DW_AT_encoding    : 7	(unsigned)
    <8c7>   DW_AT_byte_size   : 1
    <8c8>   DW_AT_type        : <0x3c>
    <8cc>   DW_AT_decl_file   : 10
    <8cd>   DW_AT_decl_line   : 102
    <8ce>   DW_AT_decl_column : 1
    <8cf>   DW_AT_sibling     : <0x8f8>
 <2><8d3>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8d4>   DW_AT_name        : (indirect string, offset: 0xb2f47): HAL_DMA_STATE_RESET
    <8d8>   DW_AT_const_value : 0
 <2><8d9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8da>   DW_AT_name        : (indirect string, offset: 0x4122c): HAL_DMA_STATE_READY
    <8de>   DW_AT_const_value : 1
 <2><8df>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8e0>   DW_AT_name        : (indirect string, offset: 0xa6647): HAL_DMA_STATE_BUSY
    <8e4>   DW_AT_const_value : 2
 <2><8e5>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8e6>   DW_AT_name        : (indirect string, offset: 0xec54c): HAL_DMA_STATE_TIMEOUT
    <8ea>   DW_AT_const_value : 3
 <2><8eb>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xcddb6): HAL_DMA_STATE_ERROR
    <8f0>   DW_AT_const_value : 4
 <2><8f1>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x35c22): HAL_DMA_STATE_ABORT
    <8f6>   DW_AT_const_value : 5
 <2><8f7>: Abbrev Number: 0
 <1><8f8>: Abbrev Number: 3 (DW_TAG_typedef)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xbc190): HAL_DMA_StateTypeDef
    <8fd>   DW_AT_decl_file   : 10
    <8fe>   DW_AT_decl_line   : 109
    <8ff>   DW_AT_decl_column : 2
    <900>   DW_AT_type        : <0x8c5>
 <1><904>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <905>   DW_AT_type        : <0x8f8>
 <1><909>: Abbrev Number: 17 (DW_TAG_structure_type)
    <90a>   DW_AT_name        : (indirect string, offset: 0xccbf3): __DMA_HandleTypeDef
    <90e>   DW_AT_byte_size   : 96
    <90f>   DW_AT_decl_file   : 10
    <910>   DW_AT_decl_line   : 137
    <911>   DW_AT_decl_column : 16
    <912>   DW_AT_sibling     : <0x9cd>
 <2><916>: Abbrev Number: 15 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0xe82b1): Instance
    <91b>   DW_AT_decl_file   : 10
    <91c>   DW_AT_decl_line   : 139
    <91d>   DW_AT_decl_column : 31
    <91e>   DW_AT_type        : <0x9cd>
    <922>   DW_AT_data_member_location: 0
 <2><923>: Abbrev Number: 15 (DW_TAG_member)
    <924>   DW_AT_name        : (indirect string, offset: 0xf4e52): Init
    <928>   DW_AT_decl_file   : 10
    <929>   DW_AT_decl_line   : 141
    <92a>   DW_AT_decl_column : 30
    <92b>   DW_AT_type        : <0x8b9>
    <92f>   DW_AT_data_member_location: 4
 <2><930>: Abbrev Number: 15 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0xab4cc): Lock
    <935>   DW_AT_decl_file   : 10
    <936>   DW_AT_decl_line   : 143
    <937>   DW_AT_decl_column : 30
    <938>   DW_AT_type        : <0x65d>
    <93c>   DW_AT_data_member_location: 52
 <2><93d>: Abbrev Number: 15 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0xf60cc): State
    <942>   DW_AT_decl_file   : 10
    <943>   DW_AT_decl_line   : 145
    <944>   DW_AT_decl_column : 30
    <945>   DW_AT_type        : <0x904>
    <949>   DW_AT_data_member_location: 53
 <2><94a>: Abbrev Number: 15 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0xe49a7): Parent
    <94f>   DW_AT_decl_file   : 10
    <950>   DW_AT_decl_line   : 147
    <951>   DW_AT_decl_column : 31
    <952>   DW_AT_type        : <0x9d3>
    <956>   DW_AT_data_member_location: 56
 <2><957>: Abbrev Number: 15 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0xeef0c): XferCpltCallback
    <95c>   DW_AT_decl_file   : 10
    <95d>   DW_AT_decl_line   : 149
    <95e>   DW_AT_decl_column : 33
    <95f>   DW_AT_type        : <0x9e6>
    <963>   DW_AT_data_member_location: 60
 <2><964>: Abbrev Number: 15 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0xbacab): XferHalfCpltCallback
    <969>   DW_AT_decl_file   : 10
    <96a>   DW_AT_decl_line   : 151
    <96b>   DW_AT_decl_column : 33
    <96c>   DW_AT_type        : <0x9e6>
    <970>   DW_AT_data_member_location: 64
 <2><971>: Abbrev Number: 15 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x8c3fb): XferM1CpltCallback
    <976>   DW_AT_decl_file   : 10
    <977>   DW_AT_decl_line   : 153
    <978>   DW_AT_decl_column : 33
    <979>   DW_AT_type        : <0x9e6>
    <97d>   DW_AT_data_member_location: 68
 <2><97e>: Abbrev Number: 15 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x726a2): XferM1HalfCpltCallback
    <983>   DW_AT_decl_file   : 10
    <984>   DW_AT_decl_line   : 155
    <985>   DW_AT_decl_column : 33
    <986>   DW_AT_type        : <0x9e6>
    <98a>   DW_AT_data_member_location: 72
 <2><98b>: Abbrev Number: 15 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x22285): XferErrorCallback
    <990>   DW_AT_decl_file   : 10
    <991>   DW_AT_decl_line   : 157
    <992>   DW_AT_decl_column : 33
    <993>   DW_AT_type        : <0x9e6>
    <997>   DW_AT_data_member_location: 76
 <2><998>: Abbrev Number: 15 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0xe04c7): XferAbortCallback
    <99d>   DW_AT_decl_file   : 10
    <99e>   DW_AT_decl_line   : 159
    <99f>   DW_AT_decl_column : 33
    <9a0>   DW_AT_type        : <0x9e6>
    <9a4>   DW_AT_data_member_location: 80
 <2><9a5>: Abbrev Number: 15 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xea7ac): ErrorCode
    <9aa>   DW_AT_decl_file   : 10
    <9ab>   DW_AT_decl_line   : 161
    <9ac>   DW_AT_decl_column : 30
    <9ad>   DW_AT_type        : <0xbc>
    <9b1>   DW_AT_data_member_location: 84
 <2><9b2>: Abbrev Number: 15 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x6a3ae): StreamBaseAddress
    <9b7>   DW_AT_decl_file   : 10
    <9b8>   DW_AT_decl_line   : 163
    <9b9>   DW_AT_decl_column : 30
    <9ba>   DW_AT_type        : <0xb0>
    <9be>   DW_AT_data_member_location: 88
 <2><9bf>: Abbrev Number: 15 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0xc9a7b): StreamIndex
    <9c4>   DW_AT_decl_file   : 10
    <9c5>   DW_AT_decl_line   : 165
    <9c6>   DW_AT_decl_column : 30
    <9c7>   DW_AT_type        : <0xb0>
    <9cb>   DW_AT_data_member_location: 92
 <2><9cc>: Abbrev Number: 0
 <1><9cd>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <9ce>   DW_AT_byte_size   : 4
    <9cf>   DW_AT_type        : <0x1b5>
 <1><9d3>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9d4>   DW_AT_byte_size   : 4
 <1><9d5>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <9d6>   DW_AT_prototyped  : 1
    <9d6>   DW_AT_sibling     : <0x9e0>
 <2><9da>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9db>   DW_AT_type        : <0x9e0>
 <2><9df>: Abbrev Number: 0
 <1><9e0>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_type        : <0x909>
 <1><9e6>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <9e7>   DW_AT_byte_size   : 4
    <9e8>   DW_AT_type        : <0x9d5>
 <1><9ec>: Abbrev Number: 3 (DW_TAG_typedef)
    <9ed>   DW_AT_name        : (indirect string, offset: 0xccbf5): DMA_HandleTypeDef
    <9f1>   DW_AT_decl_file   : 10
    <9f2>   DW_AT_decl_line   : 167
    <9f3>   DW_AT_decl_column : 2
    <9f4>   DW_AT_type        : <0x909>
 <1><9f8>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <9f9>   DW_AT_encoding    : 7	(unsigned)
    <9fa>   DW_AT_byte_size   : 1
    <9fb>   DW_AT_type        : <0x3c>
    <9ff>   DW_AT_decl_file   : 11
    <a00>   DW_AT_decl_line   : 47
    <a01>   DW_AT_decl_column : 1
    <a02>   DW_AT_sibling     : <0xa25>
 <2><a06>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a07>   DW_AT_name        : (indirect string, offset: 0xb09dc): HAL_CRC_STATE_RESET
    <a0b>   DW_AT_const_value : 0
 <2><a0c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x3e864): HAL_CRC_STATE_READY
    <a11>   DW_AT_const_value : 1
 <2><a12>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a13>   DW_AT_name        : (indirect string, offset: 0xa8b07): HAL_CRC_STATE_BUSY
    <a17>   DW_AT_const_value : 2
 <2><a18>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a19>   DW_AT_name        : (indirect string, offset: 0x8a3db): HAL_CRC_STATE_TIMEOUT
    <a1d>   DW_AT_const_value : 3
 <2><a1e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a1f>   DW_AT_name        : (indirect string, offset: 0xcb3aa): HAL_CRC_STATE_ERROR
    <a23>   DW_AT_const_value : 4
 <2><a24>: Abbrev Number: 0
 <1><a25>: Abbrev Number: 3 (DW_TAG_typedef)
    <a26>   DW_AT_name        : (indirect string, offset: 0x3d6): HAL_CRC_StateTypeDef
    <a2a>   DW_AT_decl_file   : 11
    <a2b>   DW_AT_decl_line   : 53
    <a2c>   DW_AT_decl_column : 3
    <a2d>   DW_AT_type        : <0x9f8>
 <1><a31>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a32>   DW_AT_type        : <0xa25>
 <1><a36>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a37>   DW_AT_byte_size   : 24
    <a38>   DW_AT_decl_file   : 11
    <a39>   DW_AT_decl_line   : 58
    <a3a>   DW_AT_decl_column : 9
    <a3b>   DW_AT_sibling     : <0xa9b>
 <2><a3f>: Abbrev Number: 15 (DW_TAG_member)
    <a40>   DW_AT_name        : (indirect string, offset: 0xb550e): DefaultPolynomialUse
    <a44>   DW_AT_decl_file   : 11
    <a45>   DW_AT_decl_line   : 60
    <a46>   DW_AT_decl_column : 11
    <a47>   DW_AT_type        : <0x93>
    <a4b>   DW_AT_data_member_location: 0
 <2><a4c>: Abbrev Number: 15 (DW_TAG_member)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x11cde): DefaultInitValueUse
    <a51>   DW_AT_decl_file   : 11
    <a52>   DW_AT_decl_line   : 68
    <a53>   DW_AT_decl_column : 11
    <a54>   DW_AT_type        : <0x93>
    <a58>   DW_AT_data_member_location: 1
 <2><a59>: Abbrev Number: 15 (DW_TAG_member)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x7b7b4): GeneratingPolynomial
    <a5e>   DW_AT_decl_file   : 11
    <a5f>   DW_AT_decl_line   : 73
    <a60>   DW_AT_decl_column : 12
    <a61>   DW_AT_type        : <0xb0>
    <a65>   DW_AT_data_member_location: 4
 <2><a66>: Abbrev Number: 15 (DW_TAG_member)
    <a67>   DW_AT_name        : (indirect string, offset: 0xa92cc): CRCLength
    <a6b>   DW_AT_decl_file   : 11
    <a6c>   DW_AT_decl_line   : 79
    <a6d>   DW_AT_decl_column : 12
    <a6e>   DW_AT_type        : <0xb0>
    <a72>   DW_AT_data_member_location: 8
 <2><a73>: Abbrev Number: 15 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0x721a9): InitValue
    <a78>   DW_AT_decl_file   : 11
    <a79>   DW_AT_decl_line   : 86
    <a7a>   DW_AT_decl_column : 12
    <a7b>   DW_AT_type        : <0xb0>
    <a7f>   DW_AT_data_member_location: 12
 <2><a80>: Abbrev Number: 15 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0x4f539): InputDataInversionMode
    <a85>   DW_AT_decl_file   : 11
    <a86>   DW_AT_decl_line   : 89
    <a87>   DW_AT_decl_column : 12
    <a88>   DW_AT_type        : <0xb0>
    <a8c>   DW_AT_data_member_location: 16
 <2><a8d>: Abbrev Number: 15 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x658c2): OutputDataInversionMode
    <a92>   DW_AT_decl_file   : 11
    <a93>   DW_AT_decl_line   : 99
    <a94>   DW_AT_decl_column : 12
    <a95>   DW_AT_type        : <0xb0>
    <a99>   DW_AT_data_member_location: 20
 <2><a9a>: Abbrev Number: 0
 <1><a9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x3d02b): CRC_InitTypeDef
    <aa0>   DW_AT_decl_file   : 11
    <aa1>   DW_AT_decl_line   : 104
    <aa2>   DW_AT_decl_column : 3
    <aa3>   DW_AT_type        : <0xa36>
 <1><aa7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <aa8>   DW_AT_byte_size   : 36
    <aa9>   DW_AT_decl_file   : 11
    <aaa>   DW_AT_decl_line   : 109
    <aab>   DW_AT_decl_column : 9
    <aac>   DW_AT_sibling     : <0xaf2>
 <2><ab0>: Abbrev Number: 15 (DW_TAG_member)
    <ab1>   DW_AT_name        : (indirect string, offset: 0xe82b1): Instance
    <ab5>   DW_AT_decl_file   : 11
    <ab6>   DW_AT_decl_line   : 111
    <ab7>   DW_AT_decl_column : 32
    <ab8>   DW_AT_type        : <0xaf2>
    <abc>   DW_AT_data_member_location: 0
 <2><abd>: Abbrev Number: 15 (DW_TAG_member)
    <abe>   DW_AT_name        : (indirect string, offset: 0xf4e52): Init
    <ac2>   DW_AT_decl_file   : 11
    <ac3>   DW_AT_decl_line   : 113
    <ac4>   DW_AT_decl_column : 31
    <ac5>   DW_AT_type        : <0xa9b>
    <ac9>   DW_AT_data_member_location: 4
 <2><aca>: Abbrev Number: 15 (DW_TAG_member)
    <acb>   DW_AT_name        : (indirect string, offset: 0xab4cc): Lock
    <acf>   DW_AT_decl_file   : 11
    <ad0>   DW_AT_decl_line   : 115
    <ad1>   DW_AT_decl_column : 31
    <ad2>   DW_AT_type        : <0x65d>
    <ad6>   DW_AT_data_member_location: 28
 <2><ad7>: Abbrev Number: 15 (DW_TAG_member)
    <ad8>   DW_AT_name        : (indirect string, offset: 0xf60cc): State
    <adc>   DW_AT_decl_file   : 11
    <add>   DW_AT_decl_line   : 117
    <ade>   DW_AT_decl_column : 31
    <adf>   DW_AT_type        : <0xa31>
    <ae3>   DW_AT_data_member_location: 29
 <2><ae4>: Abbrev Number: 15 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indirect string, offset: 0x3a2d5): InputDataFormat
    <ae9>   DW_AT_decl_file   : 11
    <aea>   DW_AT_decl_line   : 119
    <aeb>   DW_AT_decl_column : 12
    <aec>   DW_AT_type        : <0xb0>
    <af0>   DW_AT_data_member_location: 32
 <2><af1>: Abbrev Number: 0
 <1><af2>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <af3>   DW_AT_byte_size   : 4
    <af4>   DW_AT_type        : <0x14a>
 <1><af8>: Abbrev Number: 3 (DW_TAG_typedef)
    <af9>   DW_AT_name        : (indirect string, offset: 0x141f1): CRC_HandleTypeDef
    <afd>   DW_AT_decl_file   : 11
    <afe>   DW_AT_decl_line   : 131
    <aff>   DW_AT_decl_column : 3
    <b00>   DW_AT_type        : <0xaa7>
 <1><b04>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <b05>   DW_AT_byte_size   : 4
    <b06>   DW_AT_type        : <0x9ec>
 <1><b0a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b0b>   DW_AT_byte_size   : 24
    <b0c>   DW_AT_decl_file   : 12
    <b0d>   DW_AT_decl_line   : 46
    <b0e>   DW_AT_decl_column : 9
    <b0f>   DW_AT_sibling     : <0xb62>
 <2><b13>: Abbrev Number: 15 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0xf57d6): Prescaler
    <b18>   DW_AT_decl_file   : 12
    <b19>   DW_AT_decl_line   : 48
    <b1a>   DW_AT_decl_column : 12
    <b1b>   DW_AT_type        : <0xb0>
    <b1f>   DW_AT_data_member_location: 0
 <2><b20>: Abbrev Number: 15 (DW_TAG_member)
    <b21>   DW_AT_name        : (indirect string, offset: 0xda81c): CounterMode
    <b25>   DW_AT_decl_file   : 12
    <b26>   DW_AT_decl_line   : 51
    <b27>   DW_AT_decl_column : 12
    <b28>   DW_AT_type        : <0xb0>
    <b2c>   DW_AT_data_member_location: 4
 <2><b2d>: Abbrev Number: 15 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xf868d): Period
    <b32>   DW_AT_decl_file   : 12
    <b33>   DW_AT_decl_line   : 54
    <b34>   DW_AT_decl_column : 12
    <b35>   DW_AT_type        : <0xb0>
    <b39>   DW_AT_data_member_location: 8
 <2><b3a>: Abbrev Number: 15 (DW_TAG_member)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x60829): ClockDivision
    <b3f>   DW_AT_decl_file   : 12
    <b40>   DW_AT_decl_line   : 58
    <b41>   DW_AT_decl_column : 12
    <b42>   DW_AT_type        : <0xb0>
    <b46>   DW_AT_data_member_location: 12
 <2><b47>: Abbrev Number: 15 (DW_TAG_member)
    <b48>   DW_AT_name        : (indirect string, offset: 0xa7f5b): RepetitionCounter
    <b4c>   DW_AT_decl_file   : 12
    <b4d>   DW_AT_decl_line   : 61
    <b4e>   DW_AT_decl_column : 12
    <b4f>   DW_AT_type        : <0xb0>
    <b53>   DW_AT_data_member_location: 16
 <2><b54>: Abbrev Number: 15 (DW_TAG_member)
    <b55>   DW_AT_name        : (indirect string, offset: 0xdddcc): AutoReloadPreload
    <b59>   DW_AT_decl_file   : 12
    <b5a>   DW_AT_decl_line   : 72
    <b5b>   DW_AT_decl_column : 12
    <b5c>   DW_AT_type        : <0xb0>
    <b60>   DW_AT_data_member_location: 20
 <2><b61>: Abbrev Number: 0
 <1><b62>: Abbrev Number: 3 (DW_TAG_typedef)
    <b63>   DW_AT_name        : (indirect string, offset: 0x51b40): TIM_Base_InitTypeDef
    <b67>   DW_AT_decl_file   : 12
    <b68>   DW_AT_decl_line   : 74
    <b69>   DW_AT_decl_column : 3
    <b6a>   DW_AT_type        : <0xb0a>
 <1><b6e>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <b6f>   DW_AT_encoding    : 7	(unsigned)
    <b70>   DW_AT_byte_size   : 1
    <b71>   DW_AT_type        : <0x3c>
    <b75>   DW_AT_decl_file   : 12
    <b76>   DW_AT_decl_line   : 301
    <b78>   DW_AT_decl_column : 1
    <b79>   DW_AT_sibling     : <0xb9c>
 <2><b7d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x95a47): HAL_TIM_STATE_RESET
    <b82>   DW_AT_const_value : 0
 <2><b83>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0x89b6): HAL_TIM_STATE_READY
    <b88>   DW_AT_const_value : 1
 <2><b89>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x3b9ae): HAL_TIM_STATE_BUSY
    <b8e>   DW_AT_const_value : 2
 <2><b8f>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0x8f120): HAL_TIM_STATE_TIMEOUT
    <b94>   DW_AT_const_value : 3
 <2><b95>: Abbrev Number: 13 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0x934ae): HAL_TIM_STATE_ERROR
    <b9a>   DW_AT_const_value : 4
 <2><b9b>: Abbrev Number: 0
 <1><b9c>: Abbrev Number: 11 (DW_TAG_typedef)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x9dd56): HAL_TIM_StateTypeDef
    <ba1>   DW_AT_decl_file   : 12
    <ba2>   DW_AT_decl_line   : 307
    <ba4>   DW_AT_decl_column : 3
    <ba5>   DW_AT_type        : <0xb6e>
 <1><ba9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <baa>   DW_AT_type        : <0xb9c>
 <1><bae>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <baf>   DW_AT_encoding    : 7	(unsigned)
    <bb0>   DW_AT_byte_size   : 1
    <bb1>   DW_AT_type        : <0x3c>
    <bb5>   DW_AT_decl_file   : 12
    <bb6>   DW_AT_decl_line   : 313
    <bb8>   DW_AT_decl_column : 1
    <bb9>   DW_AT_sibling     : <0xbd0>
 <2><bbd>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bbe>   DW_AT_name        : (indirect string, offset: 0xd392): HAL_TIM_CHANNEL_STATE_RESET
    <bc2>   DW_AT_const_value : 0
 <2><bc3>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bc4>   DW_AT_name        : (indirect string, offset: 0xb8936): HAL_TIM_CHANNEL_STATE_READY
    <bc8>   DW_AT_const_value : 1
 <2><bc9>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bca>   DW_AT_name        : (indirect string, offset: 0x72841): HAL_TIM_CHANNEL_STATE_BUSY
    <bce>   DW_AT_const_value : 2
 <2><bcf>: Abbrev Number: 0
 <1><bd0>: Abbrev Number: 11 (DW_TAG_typedef)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x31ac2): HAL_TIM_ChannelStateTypeDef
    <bd5>   DW_AT_decl_file   : 12
    <bd6>   DW_AT_decl_line   : 317
    <bd8>   DW_AT_decl_column : 3
    <bd9>   DW_AT_type        : <0xbae>
 <1><bdd>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bde>   DW_AT_type        : <0xbd0>
 <1><be2>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <be3>   DW_AT_encoding    : 7	(unsigned)
    <be4>   DW_AT_byte_size   : 1
    <be5>   DW_AT_type        : <0x3c>
    <be9>   DW_AT_decl_file   : 12
    <bea>   DW_AT_decl_line   : 323
    <bec>   DW_AT_decl_column : 1
    <bed>   DW_AT_sibling     : <0xc04>
 <2><bf1>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x4d44): HAL_DMA_BURST_STATE_RESET
    <bf6>   DW_AT_const_value : 0
 <2><bf7>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x83853): HAL_DMA_BURST_STATE_READY
    <bfc>   DW_AT_const_value : 1
 <2><bfd>: Abbrev Number: 13 (DW_TAG_enumerator)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x4fcbe): HAL_DMA_BURST_STATE_BUSY
    <c02>   DW_AT_const_value : 2
 <2><c03>: Abbrev Number: 0
 <1><c04>: Abbrev Number: 11 (DW_TAG_typedef)
    <c05>   DW_AT_name        : (indirect string, offset: 0x5deea): HAL_TIM_DMABurstStateTypeDef
    <c09>   DW_AT_decl_file   : 12
    <c0a>   DW_AT_decl_line   : 327
    <c0c>   DW_AT_decl_column : 3
    <c0d>   DW_AT_type        : <0xbe2>
 <1><c11>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c12>   DW_AT_type        : <0xc04>
 <1><c16>: Abbrev Number: 22 (DW_TAG_enumeration_type)
    <c17>   DW_AT_encoding    : 7	(unsigned)
    <c18>   DW_AT_byte_size   : 1
    <c19>   DW_AT_type        : <0x3c>
    <c1d>   DW_AT_decl_file   : 12
    <c1e>   DW_AT_decl_line   : 333
    <c20>   DW_AT_decl_column : 1
    <c21>   DW_AT_sibling     : <0xc50>
 <2><c25>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c26>   DW_AT_name        : (indirect string, offset: 0x86757): HAL_TIM_ACTIVE_CHANNEL_1
    <c2a>   DW_AT_const_value : 1
 <2><c2b>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c2c>   DW_AT_name        : (indirect string, offset: 0x86770): HAL_TIM_ACTIVE_CHANNEL_2
    <c30>   DW_AT_const_value : 2
 <2><c31>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c32>   DW_AT_name        : (indirect string, offset: 0x86789): HAL_TIM_ACTIVE_CHANNEL_3
    <c36>   DW_AT_const_value : 4
 <2><c37>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c38>   DW_AT_name        : (indirect string, offset: 0x867a2): HAL_TIM_ACTIVE_CHANNEL_4
    <c3c>   DW_AT_const_value : 8
 <2><c3d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x867bb): HAL_TIM_ACTIVE_CHANNEL_5
    <c42>   DW_AT_const_value : 16
 <2><c43>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c44>   DW_AT_name        : (indirect string, offset: 0x867d4): HAL_TIM_ACTIVE_CHANNEL_6
    <c48>   DW_AT_const_value : 32
 <2><c49>: Abbrev Number: 13 (DW_TAG_enumerator)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x6201d): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <c4e>   DW_AT_const_value : 0
 <2><c4f>: Abbrev Number: 0
 <1><c50>: Abbrev Number: 11 (DW_TAG_typedef)
    <c51>   DW_AT_name        : (indirect string, offset: 0x7bd08): HAL_TIM_ActiveChannel
    <c55>   DW_AT_decl_file   : 12
    <c56>   DW_AT_decl_line   : 341
    <c58>   DW_AT_decl_column : 3
    <c59>   DW_AT_type        : <0xc16>
 <1><c5d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c5e>   DW_AT_byte_size   : 76
    <c5f>   DW_AT_decl_file   : 12
    <c60>   DW_AT_decl_line   : 349
    <c62>   DW_AT_decl_column : 9
    <c63>   DW_AT_sibling     : <0xce6>
 <2><c67>: Abbrev Number: 10 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0xe82b1): Instance
    <c6c>   DW_AT_decl_file   : 12
    <c6d>   DW_AT_decl_line   : 352
    <c6f>   DW_AT_decl_column : 39
    <c70>   DW_AT_type        : <0xce6>
    <c74>   DW_AT_data_member_location: 0
 <2><c75>: Abbrev Number: 10 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0xf4e52): Init
    <c7a>   DW_AT_decl_file   : 12
    <c7b>   DW_AT_decl_line   : 353
    <c7d>   DW_AT_decl_column : 38
    <c7e>   DW_AT_type        : <0xb62>
    <c82>   DW_AT_data_member_location: 4
 <2><c83>: Abbrev Number: 10 (DW_TAG_member)
    <c84>   DW_AT_name        : (indirect string, offset: 0x7bd16): Channel
    <c88>   DW_AT_decl_file   : 12
    <c89>   DW_AT_decl_line   : 354
    <c8b>   DW_AT_decl_column : 38
    <c8c>   DW_AT_type        : <0xc50>
    <c90>   DW_AT_data_member_location: 28
 <2><c91>: Abbrev Number: 10 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0x8f668): hdma
    <c96>   DW_AT_decl_file   : 12
    <c97>   DW_AT_decl_line   : 355
    <c99>   DW_AT_decl_column : 39
    <c9a>   DW_AT_type        : <0xcec>
    <c9e>   DW_AT_data_member_location: 32
 <2><c9f>: Abbrev Number: 10 (DW_TAG_member)
    <ca0>   DW_AT_name        : (indirect string, offset: 0xab4cc): Lock
    <ca4>   DW_AT_decl_file   : 12
    <ca5>   DW_AT_decl_line   : 357
    <ca7>   DW_AT_decl_column : 38
    <ca8>   DW_AT_type        : <0x65d>
    <cac>   DW_AT_data_member_location: 60
 <2><cad>: Abbrev Number: 10 (DW_TAG_member)
    <cae>   DW_AT_name        : (indirect string, offset: 0xf60cc): State
    <cb2>   DW_AT_decl_file   : 12
    <cb3>   DW_AT_decl_line   : 358
    <cb5>   DW_AT_decl_column : 38
    <cb6>   DW_AT_type        : <0xba9>
    <cba>   DW_AT_data_member_location: 61
 <2><cbb>: Abbrev Number: 10 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0xf5d2d): ChannelState
    <cc0>   DW_AT_decl_file   : 12
    <cc1>   DW_AT_decl_line   : 359
    <cc3>   DW_AT_decl_column : 38
    <cc4>   DW_AT_type        : <0xd0c>
    <cc8>   DW_AT_data_member_location: 62
 <2><cc9>: Abbrev Number: 10 (DW_TAG_member)
    <cca>   DW_AT_name        : (indirect string, offset: 0xf63b2): ChannelNState
    <cce>   DW_AT_decl_file   : 12
    <ccf>   DW_AT_decl_line   : 360
    <cd1>   DW_AT_decl_column : 38
    <cd2>   DW_AT_type        : <0xd21>
    <cd6>   DW_AT_data_member_location: 68
 <2><cd7>: Abbrev Number: 10 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0xf58a2): DMABurstState
    <cdc>   DW_AT_decl_file   : 12
    <cdd>   DW_AT_decl_line   : 361
    <cdf>   DW_AT_decl_column : 38
    <ce0>   DW_AT_type        : <0xc11>
    <ce4>   DW_AT_data_member_location: 72
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <ce7>   DW_AT_byte_size   : 4
    <ce8>   DW_AT_type        : <0x5fb>
 <1><cec>: Abbrev Number: 6 (DW_TAG_array_type)
    <ced>   DW_AT_type        : <0xb04>
    <cf1>   DW_AT_sibling     : <0xcfc>
 <2><cf5>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <cf6>   DW_AT_type        : <0x8c>
    <cfa>   DW_AT_upper_bound : 6
 <2><cfb>: Abbrev Number: 0
 <1><cfc>: Abbrev Number: 6 (DW_TAG_array_type)
    <cfd>   DW_AT_type        : <0xbdd>
    <d01>   DW_AT_sibling     : <0xd0c>
 <2><d05>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <d06>   DW_AT_type        : <0x8c>
    <d0a>   DW_AT_upper_bound : 5
 <2><d0b>: Abbrev Number: 0
 <1><d0c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d0d>   DW_AT_type        : <0xcfc>
 <1><d11>: Abbrev Number: 6 (DW_TAG_array_type)
    <d12>   DW_AT_type        : <0xbdd>
    <d16>   DW_AT_sibling     : <0xd21>
 <2><d1a>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <d1b>   DW_AT_type        : <0x8c>
    <d1f>   DW_AT_upper_bound : 3
 <2><d20>: Abbrev Number: 0
 <1><d21>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <d22>   DW_AT_type        : <0xd11>
 <1><d26>: Abbrev Number: 11 (DW_TAG_typedef)
    <d27>   DW_AT_name        : (indirect string, offset: 0x514b3): TIM_HandleTypeDef
    <d2b>   DW_AT_decl_file   : 12
    <d2c>   DW_AT_decl_line   : 393
    <d2e>   DW_AT_decl_column : 3
    <d2f>   DW_AT_type        : <0xc5d>
 <1><d33>: Abbrev Number: 2 (DW_TAG_base_type)
    <d34>   DW_AT_byte_size   : 1
    <d35>   DW_AT_encoding    : 8	(unsigned char)
    <d36>   DW_AT_name        : (indirect string, offset: 0xc8a00): char
 <1><d3a>: Abbrev Number: 23 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0xe497a): hcrc
    <d3f>   DW_AT_decl_file   : 1
    <d40>   DW_AT_decl_line   : 45
    <d41>   DW_AT_decl_column : 19
    <d42>   DW_AT_type        : <0xaf8>
    <d46>   DW_AT_external    : 1
    <d46>   DW_AT_location    : 5 byte block: 3 1c 2 0 20 	(DW_OP_addr: 2000021c)
 <1><d4c>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d4d>   DW_AT_external    : 1
    <d4d>   DW_AT_name        : (indirect string, offset: 0x508d9): HAL_IncTick
    <d51>   DW_AT_decl_file   : 13
    <d52>   DW_AT_decl_line   : 209
    <d53>   DW_AT_decl_column : 6
    <d54>   DW_AT_prototyped  : 1
    <d54>   DW_AT_declaration : 1
 <1><d54>: Abbrev Number: 25 (DW_TAG_subprogram)
    <d55>   DW_AT_external    : 1
    <d55>   DW_AT_name        : (indirect string, offset: 0x92bec): HAL_GPIO_Init
    <d59>   DW_AT_decl_file   : 9
    <d5a>   DW_AT_decl_line   : 223
    <d5b>   DW_AT_decl_column : 7
    <d5c>   DW_AT_prototyped  : 1
    <d5c>   DW_AT_declaration : 1
    <d5c>   DW_AT_sibling     : <0xd6b>
 <2><d60>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <d61>   DW_AT_type        : <0xd6b>
 <2><d65>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <d66>   DW_AT_type        : <0xd71>
 <2><d6a>: Abbrev Number: 0
 <1><d6b>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <d6c>   DW_AT_byte_size   : 4
    <d6d>   DW_AT_type        : <0x260>
 <1><d71>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <d72>   DW_AT_byte_size   : 4
    <d73>   DW_AT_type        : <0x7e0>
 <1><d77>: Abbrev Number: 25 (DW_TAG_subprogram)
    <d78>   DW_AT_external    : 1
    <d78>   DW_AT_name        : (indirect string, offset: 0x2a14c): HAL_GPIO_WritePin
    <d7c>   DW_AT_decl_file   : 9
    <d7d>   DW_AT_decl_line   : 234
    <d7e>   DW_AT_decl_column : 6
    <d7f>   DW_AT_prototyped  : 1
    <d7f>   DW_AT_declaration : 1
    <d7f>   DW_AT_sibling     : <0xd93>
 <2><d83>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <d84>   DW_AT_type        : <0xd6b>
 <2><d88>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <d89>   DW_AT_type        : <0xa4>
 <2><d8d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <d8e>   DW_AT_type        : <0x807>
 <2><d92>: Abbrev Number: 0
 <1><d93>: Abbrev Number: 26 (DW_TAG_subprogram)
    <d94>   DW_AT_external    : 1
    <d94>   DW_AT_name        : (indirect string, offset: 0xd85b4): HAL_CRC_Init
    <d98>   DW_AT_decl_file   : 11
    <d99>   DW_AT_decl_line   : 299
    <d9b>   DW_AT_decl_column : 19
    <d9c>   DW_AT_prototyped  : 1
    <d9c>   DW_AT_type        : <0x636>
    <da0>   DW_AT_declaration : 1
    <da0>   DW_AT_sibling     : <0xdaa>
 <2><da4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <da5>   DW_AT_type        : <0xdaa>
 <2><da9>: Abbrev Number: 0
 <1><daa>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <dab>   DW_AT_byte_size   : 4
    <dac>   DW_AT_type        : <0xaf8>
 <1><db0>: Abbrev Number: 26 (DW_TAG_subprogram)
    <db1>   DW_AT_external    : 1
    <db1>   DW_AT_name        : (indirect string, offset: 0xce101): HAL_RCC_ClockConfig
    <db5>   DW_AT_decl_file   : 8
    <db6>   DW_AT_decl_line   : 1137
    <db8>   DW_AT_decl_column : 19
    <db9>   DW_AT_prototyped  : 1
    <db9>   DW_AT_type        : <0x636>
    <dbd>   DW_AT_declaration : 1
    <dbd>   DW_AT_sibling     : <0xdcc>
 <2><dc1>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <dc2>   DW_AT_type        : <0xdcc>
 <2><dc6>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <dc7>   DW_AT_type        : <0xb0>
 <2><dcb>: Abbrev Number: 0
 <1><dcc>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <dcd>   DW_AT_byte_size   : 4
    <dce>   DW_AT_type        : <0x789>
 <1><dd2>: Abbrev Number: 27 (DW_TAG_subprogram)
    <dd3>   DW_AT_external    : 1
    <dd3>   DW_AT_name        : (indirect string, offset: 0xb389b): HAL_PWREx_EnableOverDrive
    <dd7>   DW_AT_decl_file   : 17
    <dd8>   DW_AT_decl_line   : 196
    <dd9>   DW_AT_decl_column : 19
    <dda>   DW_AT_prototyped  : 1
    <dda>   DW_AT_type        : <0x636>
    <dde>   DW_AT_declaration : 1
 <1><dde>: Abbrev Number: 26 (DW_TAG_subprogram)
    <ddf>   DW_AT_external    : 1
    <ddf>   DW_AT_name        : (indirect string, offset: 0xa5e26): HAL_RCC_OscConfig
    <de3>   DW_AT_decl_file   : 8
    <de4>   DW_AT_decl_line   : 1136
    <de6>   DW_AT_decl_column : 19
    <de7>   DW_AT_prototyped  : 1
    <de7>   DW_AT_type        : <0x636>
    <deb>   DW_AT_declaration : 1
    <deb>   DW_AT_sibling     : <0xdf5>
 <2><def>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <df0>   DW_AT_type        : <0xdf5>
 <2><df4>: Abbrev Number: 0
 <1><df5>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <df6>   DW_AT_byte_size   : 4
    <df7>   DW_AT_type        : <0x732>
 <1><dfb>: Abbrev Number: 28 (DW_TAG_subprogram)
    <dfc>   DW_AT_external    : 1
    <dfc>   DW_AT_name        : (indirect string, offset: 0x8cffc): vTaskStartScheduler
    <e00>   DW_AT_decl_file   : 14
    <e01>   DW_AT_decl_line   : 1253
    <e03>   DW_AT_decl_column : 6
    <e04>   DW_AT_prototyped  : 1
    <e04>   DW_AT_declaration : 1
 <1><e04>: Abbrev Number: 24 (DW_TAG_subprogram)
    <e05>   DW_AT_external    : 1
    <e05>   DW_AT_name        : (indirect string, offset: 0x1d6fd): Start_UARTrx_tasks
    <e09>   DW_AT_decl_file   : 15
    <e0a>   DW_AT_decl_line   : 19
    <e0b>   DW_AT_decl_column : 6
    <e0c>   DW_AT_prototyped  : 1
    <e0c>   DW_AT_declaration : 1
 <1><e0c>: Abbrev Number: 24 (DW_TAG_subprogram)
    <e0d>   DW_AT_external    : 1
    <e0d>   DW_AT_name        : (indirect string, offset: 0xccdc6): Start_USB_cmd_tasks
    <e11>   DW_AT_decl_file   : 16
    <e12>   DW_AT_decl_line   : 93
    <e13>   DW_AT_decl_column : 6
    <e14>   DW_AT_prototyped  : 1
    <e14>   DW_AT_declaration : 1
 <1><e14>: Abbrev Number: 27 (DW_TAG_subprogram)
    <e15>   DW_AT_external    : 1
    <e15>   DW_AT_name        : (indirect string, offset: 0xe1240): HAL_Init
    <e19>   DW_AT_decl_file   : 13
    <e1a>   DW_AT_decl_line   : 185
    <e1b>   DW_AT_decl_column : 19
    <e1c>   DW_AT_prototyped  : 1
    <e1c>   DW_AT_type        : <0x636>
    <e20>   DW_AT_declaration : 1
 <1><e20>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e21>   DW_AT_external    : 1
    <e21>   DW_AT_name        : (indirect string, offset: 0x6934c): Error_Handler
    <e25>   DW_AT_decl_file   : 1
    <e26>   DW_AT_decl_line   : 289
    <e28>   DW_AT_decl_column : 6
    <e29>   DW_AT_prototyped  : 1
    <e29>   DW_AT_low_pc      : 0x80007b8
    <e2d>   DW_AT_high_pc     : 0xa
    <e31>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e33>   DW_AT_GNU_all_call_sites: 1
    <e33>   DW_AT_sibling     : <0xe49>
 <2><e37>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <e38>   DW_AT_abstract_origin: <0xfc0>
    <e3c>   DW_AT_low_pc      : 0x80007bc
    <e40>   DW_AT_high_pc     : 0x4
    <e44>   DW_AT_call_file   : 1
    <e45>   DW_AT_call_line   : 293
    <e47>   DW_AT_call_column : 3
 <2><e48>: Abbrev Number: 0
 <1><e49>: Abbrev Number: 31 (DW_TAG_subprogram)
    <e4a>   DW_AT_external    : 1
    <e4a>   DW_AT_name        : (indirect string, offset: 0xc9053): HAL_TIM_PeriodElapsedCallback
    <e4e>   DW_AT_decl_file   : 1
    <e4f>   DW_AT_decl_line   : 272
    <e51>   DW_AT_decl_column : 6
    <e52>   DW_AT_prototyped  : 1
    <e52>   DW_AT_low_pc      : 0x8000794
    <e56>   DW_AT_high_pc     : 0x24
    <e5a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5c>   DW_AT_GNU_all_tail_call_sites: 1
    <e5c>   DW_AT_sibling     : <0xe71>
 <2><e60>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <e61>   DW_AT_name        : (indirect string, offset: 0xbca55): htim
    <e65>   DW_AT_decl_file   : 1
    <e66>   DW_AT_decl_line   : 272
    <e68>   DW_AT_decl_column : 55
    <e69>   DW_AT_type        : <0xe71>
    <e6d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <e72>   DW_AT_byte_size   : 4
    <e73>   DW_AT_type        : <0xd26>
 <1><e77>: Abbrev Number: 33 (DW_TAG_subprogram)
    <e78>   DW_AT_name        : (indirect string, offset: 0x60f14): MX_GPIO_Init
    <e7c>   DW_AT_decl_file   : 1
    <e7d>   DW_AT_decl_line   : 215
    <e7e>   DW_AT_decl_column : 13
    <e7f>   DW_AT_prototyped  : 1
    <e7f>   DW_AT_low_pc      : 0x8000668
    <e83>   DW_AT_high_pc     : 0x12c
    <e87>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e89>   DW_AT_GNU_all_tail_call_sites: 1
    <e89>   DW_AT_sibling     : <0xf2a>
 <2><e8d>: Abbrev Number: 34 (DW_TAG_variable)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x16fc7): GPIO_InitStruct
    <e92>   DW_AT_decl_file   : 1
    <e93>   DW_AT_decl_line   : 217
    <e94>   DW_AT_decl_column : 20
    <e95>   DW_AT_type        : <0x7e0>
    <e99>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><e9c>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <e9d>   DW_AT_low_pc      : 0x800067e
    <ea1>   DW_AT_high_pc     : 0x18
    <ea5>   DW_AT_sibling     : <0xeb9>
 <3><ea9>: Abbrev Number: 34 (DW_TAG_variable)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <eae>   DW_AT_decl_file   : 1
    <eaf>   DW_AT_decl_line   : 220
    <eb0>   DW_AT_decl_column : 3
    <eb1>   DW_AT_type        : <0xbc>
    <eb5>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><eb8>: Abbrev Number: 0
 <2><eb9>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <eba>   DW_AT_low_pc      : 0x8000696
    <ebe>   DW_AT_high_pc     : 0x18
    <ec2>   DW_AT_sibling     : <0xed6>
 <3><ec6>: Abbrev Number: 34 (DW_TAG_variable)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <ecb>   DW_AT_decl_file   : 1
    <ecc>   DW_AT_decl_line   : 221
    <ecd>   DW_AT_decl_column : 3
    <ece>   DW_AT_type        : <0xbc>
    <ed2>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><ed5>: Abbrev Number: 0
 <2><ed6>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <ed7>   DW_AT_low_pc      : 0x80006ae
    <edb>   DW_AT_high_pc     : 0x18
    <edf>   DW_AT_sibling     : <0xef3>
 <3><ee3>: Abbrev Number: 34 (DW_TAG_variable)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <ee8>   DW_AT_decl_file   : 1
    <ee9>   DW_AT_decl_line   : 222
    <eea>   DW_AT_decl_column : 3
    <eeb>   DW_AT_type        : <0xbc>
    <eef>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><ef2>: Abbrev Number: 0
 <2><ef3>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <ef4>   DW_AT_low_pc      : 0x80006c6
    <ef8>   DW_AT_high_pc     : 0x18
    <efc>   DW_AT_sibling     : <0xf10>
 <3><f00>: Abbrev Number: 34 (DW_TAG_variable)
    <f01>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <f05>   DW_AT_decl_file   : 1
    <f06>   DW_AT_decl_line   : 223
    <f07>   DW_AT_decl_column : 3
    <f08>   DW_AT_type        : <0xbc>
    <f0c>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><f0f>: Abbrev Number: 0
 <2><f10>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <f11>   DW_AT_low_pc      : 0x80006de
    <f15>   DW_AT_high_pc     : 0x18
 <3><f19>: Abbrev Number: 34 (DW_TAG_variable)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <f1e>   DW_AT_decl_file   : 1
    <f1f>   DW_AT_decl_line   : 224
    <f20>   DW_AT_decl_column : 3
    <f21>   DW_AT_type        : <0xbc>
    <f25>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><f28>: Abbrev Number: 0
 <2><f29>: Abbrev Number: 0
 <1><f2a>: Abbrev Number: 37 (DW_TAG_subprogram)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x83a83): MX_CRC_Init
    <f2f>   DW_AT_decl_file   : 1
    <f30>   DW_AT_decl_line   : 170
    <f31>   DW_AT_decl_column : 13
    <f32>   DW_AT_prototyped  : 1
    <f32>   DW_AT_low_pc      : 0x8000610
    <f36>   DW_AT_high_pc     : 0x58
    <f3a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f3c>   DW_AT_GNU_all_tail_call_sites: 1
 <1><f3c>: Abbrev Number: 38 (DW_TAG_subprogram)
    <f3d>   DW_AT_external    : 1
    <f3d>   DW_AT_name        : (indirect string, offset: 0xa646d): SystemClock_Config
    <f41>   DW_AT_decl_file   : 1
    <f42>   DW_AT_decl_line   : 117
    <f43>   DW_AT_decl_column : 6
    <f44>   DW_AT_prototyped  : 1
    <f44>   DW_AT_low_pc      : 0x8000538
    <f48>   DW_AT_high_pc     : 0xd8
    <f4c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4e>   DW_AT_GNU_all_tail_call_sites: 1
    <f4e>   DW_AT_sibling     : <0xfaa>
 <2><f52>: Abbrev Number: 34 (DW_TAG_variable)
    <f53>   DW_AT_name        : (indirect string, offset: 0x33820): RCC_OscInitStruct
    <f57>   DW_AT_decl_file   : 1
    <f58>   DW_AT_decl_line   : 119
    <f59>   DW_AT_decl_column : 22
    <f5a>   DW_AT_type        : <0x732>
    <f5e>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><f61>: Abbrev Number: 34 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0x59bfe): RCC_ClkInitStruct
    <f66>   DW_AT_decl_file   : 1
    <f67>   DW_AT_decl_line   : 120
    <f68>   DW_AT_decl_column : 22
    <f69>   DW_AT_type        : <0x789>
    <f6d>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><f71>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <f72>   DW_AT_low_pc      : 0x800055c
    <f76>   DW_AT_high_pc     : 0x18
    <f7a>   DW_AT_sibling     : <0xf8f>
 <3><f7e>: Abbrev Number: 34 (DW_TAG_variable)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <f83>   DW_AT_decl_file   : 1
    <f84>   DW_AT_decl_line   : 124
    <f85>   DW_AT_decl_column : 3
    <f86>   DW_AT_type        : <0xbc>
    <f8a>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><f8e>: Abbrev Number: 0
 <2><f8f>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <f90>   DW_AT_low_pc      : 0x8000574
    <f94>   DW_AT_high_pc     : 0x18
 <3><f98>: Abbrev Number: 34 (DW_TAG_variable)
    <f99>   DW_AT_name        : (indirect string, offset: 0x1bf1): tmpreg
    <f9d>   DW_AT_decl_file   : 1
    <f9e>   DW_AT_decl_line   : 125
    <f9f>   DW_AT_decl_column : 3
    <fa0>   DW_AT_type        : <0xbc>
    <fa4>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><fa8>: Abbrev Number: 0
 <2><fa9>: Abbrev Number: 0
 <1><faa>: Abbrev Number: 39 (DW_TAG_subprogram)
    <fab>   DW_AT_external    : 1
    <fab>   DW_AT_name        : (indirect string, offset: 0x17c5b): main
    <faf>   DW_AT_decl_file   : 1
    <fb0>   DW_AT_decl_line   : 68
    <fb1>   DW_AT_decl_column : 5
    <fb2>   DW_AT_prototyped  : 1
    <fb2>   DW_AT_type        : <0x85>
    <fb6>   DW_AT_low_pc      : 0x8000514
    <fba>   DW_AT_high_pc     : 0x22
    <fbe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fc0>   DW_AT_GNU_all_tail_call_sites: 1
 <1><fc0>: Abbrev Number: 40 (DW_TAG_subprogram)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x21374): __disable_irq
    <fc5>   DW_AT_decl_file   : 2
    <fc6>   DW_AT_decl_line   : 140
    <fc7>   DW_AT_decl_column : 27
    <fc8>   DW_AT_prototyped  : 1
    <fc8>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><fc9>: Abbrev Number: 0
  Compilation Unit @ offset 0xfca:
   Length:        0x527 (32-bit)
   Version:       4
   Abbrev Offset: 0x29a
   Pointer Size:  4
 <0><fd5>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <fd6>   DW_AT_producer    : (indirect string, offset: 0xce441): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <fda>   DW_AT_language    : 12	(ANSI C99)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xf0d19): ../Core/Src/stm32f7xx_hal_msp.c
    <fdf>   DW_AT_comp_dir    : (indirect string, offset: 0x20d03): C:/Users/NDC/Desktop/conc_test/Debug
    <fe3>   DW_AT_ranges      : 0x38
    <fe7>   DW_AT_low_pc      : 0x0
    <feb>   DW_AT_stmt_list   : 0xc79
    <fef>   DW_AT_GNU_macros  : 0x2423d
 <1><ff3>: Abbrev Number: 2 (DW_TAG_base_type)
    <ff4>   DW_AT_byte_size   : 1
    <ff5>   DW_AT_encoding    : 6	(signed char)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x776bc): signed char
 <1><ffa>: Abbrev Number: 3 (DW_TAG_typedef)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x4500c): __uint8_t
    <fff>   DW_AT_decl_file   : 2
    <1000>   DW_AT_decl_line   : 43
    <1001>   DW_AT_decl_column : 24
    <1002>   DW_AT_type        : <0x1006>
 <1><1006>: Abbrev Number: 2 (DW_TAG_base_type)
    <1007>   DW_AT_byte_size   : 1
    <1008>   DW_AT_encoding    : 8	(unsigned char)
    <1009>   DW_AT_name        : (indirect string, offset: 0xe7d8b): unsigned char
 <1><100d>: Abbrev Number: 2 (DW_TAG_base_type)
    <100e>   DW_AT_byte_size   : 2
    <100f>   DW_AT_encoding    : 5	(signed)
    <1010>   DW_AT_name        : (indirect string, offset: 0xb2a85): short int
 <1><1014>: Abbrev Number: 3 (DW_TAG_typedef)
    <1015>   DW_AT_name        : (indirect string, offset: 0xc3fcd): __uint16_t
    <1019>   DW_AT_decl_file   : 2
    <101a>   DW_AT_decl_line   : 57
    <101b>   DW_AT_decl_column : 25
    <101c>   DW_AT_type        : <0x1020>
 <1><1020>: Abbrev Number: 2 (DW_TAG_base_type)
    <1021>   DW_AT_byte_size   : 2
    <1022>   DW_AT_encoding    : 7	(unsigned)
    <1023>   DW_AT_name        : (indirect string, offset: 0xe6419): short unsigned int
 <1><1027>: Abbrev Number: 2 (DW_TAG_base_type)
    <1028>   DW_AT_byte_size   : 4
    <1029>   DW_AT_encoding    : 5	(signed)
    <102a>   DW_AT_name        : (indirect string, offset: 0x143d1): long int
 <1><102e>: Abbrev Number: 3 (DW_TAG_typedef)
    <102f>   DW_AT_name        : (indirect string, offset: 0x98220): __uint32_t
    <1033>   DW_AT_decl_file   : 2
    <1034>   DW_AT_decl_line   : 79
    <1035>   DW_AT_decl_column : 25
    <1036>   DW_AT_type        : <0x103a>
 <1><103a>: Abbrev Number: 2 (DW_TAG_base_type)
    <103b>   DW_AT_byte_size   : 4
    <103c>   DW_AT_encoding    : 7	(unsigned)
    <103d>   DW_AT_name        : (indirect string, offset: 0x5ae3b): long unsigned int
 <1><1041>: Abbrev Number: 2 (DW_TAG_base_type)
    <1042>   DW_AT_byte_size   : 8
    <1043>   DW_AT_encoding    : 5	(signed)
    <1044>   DW_AT_name        : (indirect string, offset: 0x6c6a0): long long int
 <1><1048>: Abbrev Number: 2 (DW_TAG_base_type)
    <1049>   DW_AT_byte_size   : 8
    <104a>   DW_AT_encoding    : 7	(unsigned)
    <104b>   DW_AT_name        : (indirect string, offset: 0x3159c): long long unsigned int
 <1><104f>: Abbrev Number: 4 (DW_TAG_base_type)
    <1050>   DW_AT_byte_size   : 4
    <1051>   DW_AT_encoding    : 5	(signed)
    <1052>   DW_AT_name        : int
 <1><1056>: Abbrev Number: 2 (DW_TAG_base_type)
    <1057>   DW_AT_byte_size   : 4
    <1058>   DW_AT_encoding    : 7	(unsigned)
    <1059>   DW_AT_name        : (indirect string, offset: 0x13688): unsigned int
 <1><105d>: Abbrev Number: 3 (DW_TAG_typedef)
    <105e>   DW_AT_name        : (indirect string, offset: 0x4500e): uint8_t
    <1062>   DW_AT_decl_file   : 3
    <1063>   DW_AT_decl_line   : 24
    <1064>   DW_AT_decl_column : 19
    <1065>   DW_AT_type        : <0xffa>
 <1><1069>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <106a>   DW_AT_type        : <0x105d>
 <1><106e>: Abbrev Number: 3 (DW_TAG_typedef)
    <106f>   DW_AT_name        : (indirect string, offset: 0xaf6bf): uint16_t
    <1073>   DW_AT_decl_file   : 3
    <1074>   DW_AT_decl_line   : 36
    <1075>   DW_AT_decl_column : 20
    <1076>   DW_AT_type        : <0x1014>
 <1><107a>: Abbrev Number: 3 (DW_TAG_typedef)
    <107b>   DW_AT_name        : (indirect string, offset: 0xe6047): uint32_t
    <107f>   DW_AT_decl_file   : 3
    <1080>   DW_AT_decl_line   : 48
    <1081>   DW_AT_decl_column : 20
    <1082>   DW_AT_type        : <0x102e>
 <1><1086>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1087>   DW_AT_type        : <0x107a>
 <1><108b>: Abbrev Number: 6 (DW_TAG_array_type)
    <108c>   DW_AT_type        : <0x107a>
    <1090>   DW_AT_sibling     : <0x109b>
 <2><1094>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <1095>   DW_AT_type        : <0x1056>
    <1099>   DW_AT_upper_bound : 1
 <2><109a>: Abbrev Number: 0
 <1><109b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <109c>   DW_AT_byte_size   : 24
    <109d>   DW_AT_decl_file   : 4
    <109e>   DW_AT_decl_line   : 302
    <10a0>   DW_AT_decl_column : 9
    <10a1>   DW_AT_sibling     : <0x1114>
 <2><10a5>: Abbrev Number: 9 (DW_TAG_member)
    <10a6>   DW_AT_name        : DR
    <10a9>   DW_AT_decl_file   : 4
    <10aa>   DW_AT_decl_line   : 304
